{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "A Comparative Study of Control Strategies for Expert Systems", "Title": "Age Implementation of Three Variations of PUFF", "Abstract": "This paper presents the results of comparing three control strategies for expert systems: event driven, expectation driven, and goal driven. Three different versions of a pulmonary function analysis system (PUFF) were implemented, each with a different control strategy. The systems are described and compared for efficiency and naturalness. The advantages and disadvantages of each strategy are discussed. The reasons why one approach, the expectation-drive strategy, is best suited for the PUFF application are summarized."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Diagnosis Via Causal Reasoning", "Title": "Paths of Interaction and the Locality Principle", "Abstract": "Interest has grown recently in developing expert systems that reason \"from first principles\", i.e., capable of the kind of problem solving exhibited by an engineer who can diagnose a malfunctioning device by reference to its schematics, even though he may never have seen that device before. In developing such a system for troubleshooting digital electronics, we have argued for the importance of pathways of causal interaction as a key concept. We have also suggested using a layered set of interaction paths as a way of constraining and guiding the diagnostic process. We report here on the implementation and use of these ideas. We show how they make it possible for our system to generate a few sharply constrained hypotheses in diagnosing a bridge fault. Abstracting from this example, we find a number of interesting general principles at work. We suggest that diagnosis can be viewed as the interaction of simulation and inference and we find that the concept of locality proves to be extremely useful in understanding why bridge faults are difficult to diagnose and why multiple representations are useful."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "TALIB", "Title": "An IC Layout Design Assistant", "Abstract": "This paper describes a knowledge-based system for automatically synthesizing integrated circuit layouts for NMOS cells. The desired cell layouts are specified in terms of their general structural and functional characteristics. From these initial specifications, the system produces correct and compact cell layouts. The system performs this task by generating plan steps at different levels of abstraction and opportunistically refining each plan step at one level to more specific steps at a lower level. Although the implementation of this system has focused on NMOS technology, the techniques used are not restricted to that technology.'"}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "A Rule-Based Approach to Information Retrieval", "Title": "Some Results and Comments", "Abstract": "This paper is a report of our early efforts to use a rule-based approach in the information retrieval task. We have developed a prototype system that allows the user to specify his or her retrieval concept as a hierarchy of sub-concepts which are then implemented as a set of production rules. The paper contains a brief description of the system and some of the preliminary testing we have done. In particular, we make some observations on the need for an appropriate language for expressing conceptual queries, and on the interactions between rule formulation and uncertainty representation."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "IMPULSE", "Title": "A Display Oriented Editor for STROBE", "Abstract": "In this paper, we discuss a display-oriented editor to aid in the construction of knowledge-based systems. We also report on our experiences concerning the utility of the editor."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "YAPS", "Title": "A Production Rule System Meets Objects", "Abstract": "This paper describes an antecedent-driven pro-duction system, YAPS (Yet Another Production Sys-tem) which encodes the left hand sides of produc-ion rules into a discrimination net in a manner similar to that used by Forgy ([Forgy 811, [Forgy 791) in OPS5. YAPS, however, gives the user more flexibility in the structure of facts in the data- base, the kinds of tests that can appear on the left hand side of production rules and the actions that can appear on the right hand side of the rules. This flexibility is realized without sac-rificing the efficiency gained by OPS5 through its discrimination net implementation. The paper also discusses how YAPS can be used in conjunction with object oriented programming systems to yield a sys-tem in which rules can talk about objects and objects can have daemons attached to them. It discusses methods of dividing YAPS into independent rule sets sharing global facts."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Massively Parallel Architectures for Al", "Title": "NETL, Thistle, and Boltzmann Machines", "Abstract": "It is becoming increasingly apparent that some aspects of intelligent behavior require enormous computational power and that some sort of massively parallel computing architecture is the most plausible way to deliver such power. Parallelism, rather than raw speed of the computing elements. seems to be the way that the brain gets such jobs done. But even if the need for massive parallelism is admitted, there is still the question of what kind of parallel architecture best fits the needs of various AI tasks. In this paper we will attempt to isolate a number of basic computational tasks that an intelligent system must perform. We will describe several families of massively parallel computing architectures, and we will see which of these computational tasks can be handled by each of these families. In particular, we will describe a new architecture, which we call the Boltzmann machine, whose abilities appear to include a number of tasks that are inefficient or impossible on the other architectures."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Reasons for Beliefs in Understanding", "Title": "Applications of Non-Monotonic Dependencies to Story Processing", "Abstract": "Many of the inferences and decisions which contribute to understanding involve fallible assumptions. When these assumptions are under-mined, computational models of comprehension should respond rationally. This paper crossbreeds AI research on problem solving and understanding to produce a hybrid model (\"reasoned understand-ing\"). In particular, the paper shows how non-monotonic dependencies [Doyle79] enable a schema-based story processor to adjust to new information requiring the retraction of assumptions."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "MCHART", "Title": "A Flexible, Modular Chart Parsing System", "Abstract": "One of the most attractive properties of the active chart parsing methodology (Kay 1980; Thompson and Ritchie 1983) is the distinction it makes possible between essential bookkeeping mechanisms, scheduling issues, and details of grammatical formalisms. MCHART is a framework within which active chart parsing systems can be constructed. It provides the essential book- keeping mechanisms, and carefully structured interfaces for the specification of scheduling and grammatical formalism. The resulting flexibility makes it useful both for pedagogical purposes and for quick prototyping. The system is available in UCILISP, FranzLisp, and Interlisp versions, together with a simple lexicon facility, example parsers and detailed documentation."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "QE-III", "Title": "A Formal Approach to Natural Language Querying", "Abstract": "In this Paper we present an overview of QE-III, a language designed for natural-language querying of historical databases. QE-III is defined formally with a Montague Grammar, extended to provide an interpretation for questions and temporal reference. Moreover, in addition to the traditional syntactic formal pragmatic interpretation for-the semantic components, a sentences of QE-III is also defined."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Repairing Miscommunication", "Title": "Relaxation in Reference", "Abstract": "In natural language interactions, a speaker and a listener cannot be assured to have the same beliefs, contexts, backgrounds or goals. This leads to difficulties and mistakes when a listener tries to interpret a speaker’s utterance. One principal source of trouble is the description constructed by the speaker to refer to an actual object in the world. The description can be imprecise, confused, ambiguous or overly specific; it might be interpreted under the wrong context. This paper explores the problem of resolving such reference failures in the context of the task of assembling a toy water pump. We are using actual protocols to drive the design of a program that plays the part of an apprentice who must interpret the instructions of an expert and carry them out. A primary means for the apprentice to repair such descriptions is by relaxing parts of the description."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "RESEARCHER", "Title": "An Overview", "Abstract": "Described in this paper is a computer system, RESEARCHER, being developed at Columbia that reads natural language text in the form of patent abstracts and creates a permanent long-term memory based on concepts generalized from these texts, forming an intelligent information system. This paper is intended to give an overview of RESEARCHER. We will describe briefly the four main areas dealt with in the design of RESEARCHER: 1) knowledge representation where a canonical scheme for representing physical objects has been developed, 2) memory-based text processing, 3) and generalization and generalization-based memory organization that treats concept formation as an integral part of understanding, and 4) generalization-based question and answering."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Theory Resolution", "Title": "Building in Nonequational Theories", "Abstract": "Theory resolution constitutes a set of complete proce-dures for building nonequational theories into a resolution theorem-proving program so that axioms of the theory need never be resolved upon. Total theory resolution uses a deci- sion procedure that is capable of determining inconsistency of any set of clauses using predicates in the theory. Partial theory resolution employs a weaker decision procedure that can determine potential inconsistency of a pair of literals. Applications include the building in of both mathematical and special decision procedures, such as for the taxonomic information furnished by a knowledge representation sys-tem."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "KRYPTON", "Title": "Integrating Terminology and Assertion", "Abstract": "The demands placed on a knowledge representation scheme by a knowl-edge-based system are generally not all met by any of today’s can-didates. Representation languages based on frames or semantic net-works have intuitive appeal for forming descriptions but tend to have severely limited assertional power, and are often fraught with am-biguous readings. Those based on first-order logic are less limited assertionally, but are restricted to primitive, unrelated terms. We have attempted to overcome these limitations in a new, hybrid knowledge representation system, called \"KRYPTON\". KRYPTON has two rep- resentation languages, a frame-based one for forming domain-specific descriptive terms and a logic-based one for making statements about the world. We here summarize the two languages, a functional inter-face to the system, and an implementation in terms of a taxonomy of frames and its interaction with a first-order theorem prover."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "An Automatic Algorithm Designer", "Title": "An Initial Implementation", "Abstract": "This paper outlines a specification for an algorithm-design system (based on previous work involving protocol analysis) and describes an implementation of the specification that is a combination frame and production system. In the implementation, design occurs in two problem spaces -- one about algorithms and one about the task-domain. The partially worked out algorithms are represented as configurations of data-flow components. A small number of general-purpose operators construct and modify the representations. These operators are adapted to different situations by instantiation and means-ends analysis rules. The data-flow space also includes symbolic and test-case execution rules that drive the component-refinement orocess by exposing both problems and opportunities. A domain space about geometric images supports test,case execution, domain-specific problem solving, recognition and discovery."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Default Reasoning Using Monotonic Logic", "Title": "A Modest Proposal", "Abstract": "This paper presents a simple extension of first order predicate logic to include a default operator. Rules of inference governing the operator are specified, and a model theory for interpreting sentences involving default operstor is developed based on standard Tarslian semantics. The Resulting system is trivially sound. It is argued that (a) this logic provides an adequate basis for default reasoning in A.I. systems, and (b) unlike most logics proposed for this purpose, it retains the virtues of standard first order logic, including both montonicity and simplicity."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "The Decomposition of a Large Domain", "Title": "Reasoning about Machines", "Abstract": "The world of machines is divided into a hierarchy of seven sub-worlds, ranging from algebra to causality. Separate representations and experts are constructed for each sub-world; these experts are then integrated into an expert system. The result is Mack, a system which produces qualitative models of simple machines from purely geometric representations."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Operator Decomposability", "Title": "A New Type of Problem Structure", "Abstract": "This paper describes a structural property of problems that allows an efficient strategy for solving a large number of problem instances to be based on a small amount of knowledge. Specifically, the property of operator decomposability is shown to be a sufficient condition for the effective application of the Macro Problem Solver, a method that represents its knowledge of a problem by a small number of operator sequences. Roughly, operator decomposability exists in a problem to the extent that the effect of an operator on each component of a state can be expressed as a function of only a subset of the components, independent of the remaining state components."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Learning", "Title": "The Construction of A Posteriori Knowledge Structures", "Abstract": "This paper is a critical examination of both the nature of learning and its value in artificial intelligence. After examining alternative definitions it is concluded that learning is in fact any process for the acquisition of synthetic a posteriori knowledge structures. The suggestion that learning will not prove useful in machines is examined and it is argued. that its main application in practical Al systems terns is in providing a means by which a system can acquire knowledge which is not readily formalizable. Finally some of the implications of these conclusions for future Al research are explored."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Human Procedural Skill Acquisition", "Title": "Theory, Model and Psychological Validation", "Abstract": "It is widely held that ordinary natural language conversations are governed by tacit conventions. called felicity conditions or conversational postulates (Austin. 1962: Grice. 1975: Gordon and Lakoff, 1975). Learning a procedural skill is also a communication act. The teacher communicates a procedure to the student over the course of several lessons. The central idea of the theory to be presented is that there are specific felicity conditions that govern learning. In particular, five newly discovered felicity conditions govern the kind of skill acquisition studied here. The theory has been embedded in a learning model. a large Al-based computer program. The model' s performance has been compared to data from several thousand students learning ordinary mathematical procedures: subtracting multidigit numbers, adding fractions, and solving simple algebraic equations. A key criterion for the theory is that the set of procedures that the model learns should exactly match the set of procedures that students actually acquire, including their \"buggy\" procedures. However, much more is needed for psychological validation of this theory, or any complex Al-based theory, than merely testing its predictions. The method used with this theory is presented."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "STRATEGIST", "Title": "A Program That Models Strategy-Driven and Content-Driven Inference Behavior", "Abstract": "In the course of understanding a text, different readers use different inference strategies to guide their choice of interpretations of the events in the text. This is in contrast to previous computer models of understanding, which all use the same (single) strategy while concentrating on details of content-driven inference. The separate strategies are theorized to be composed of the same component inference process, but of different rules for application of the processes. The use of different strategies occasionally results in different intrepretations of a single text. This paper presents both the results in different interpretations of a single text. This paper presents both the results of new experimental data and a working computer program, called STRATEGIST, that models both strategy-driven and content-driven inference behavior. The rules which make up two of these strategies are presented."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Planning and Goal Interaction", "Title": "The Use of Past Solutions in Present Situations", "Abstract": "This paper presents WOK, a cased-based planner that makes use of memory structures based on goal interactions. WOK generates original plans, (which take the form of recipes), in the domain of Szechuan cooking, by modifying existing plans that are stored and then retrieved on the basis of the goal interactions that they deal with. The paper suggests an organization and indexing strategy that allows the retrieval and use of plans that overarch sets of goals rather than just individual goal situations. It also demonstrates how episodic knowledge can be used to guide planning and avoid past failures."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Modeling Human Knowledge of Routes", "Title": "Partial Knowledge and Individual Variation", "Abstract": "Commonsense knowledge of large-scale space (the cognitive map) includes several different types of knowledge: of sensorimotor, topological, and metrical spatial relationships. Sensorimotor knowledge is defined as that knowledge which is necessary to reconstruct a route from memory after travel along that route in a large-scale environment. A representation for route knowledge is proposed with sufficiently robust performance properties to be useful as commonsense knowledge. Its states of partial knowledge are shown to correspond to those observed in humans. We also define and explore the space of all possible variants of this representation, to derive empirical predictions about the nature of individual variation."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "An Analysis of a Welfare Eligibility Determination Interview", "Title": "A Planning Approach", "Abstract": "The purpose of this research is to identify strategies and plans used by welfare caseworkers in order to build an expert system to determine welfare eligibility. Here we use the framework of proposed by Hobbs and Evans(1979) to analyze the conversational plans of a welfare caseworker while conducting an eligibility interview. We study the plans used by the caseworker, show the interaction between goals and themes, and study the influence of constraints imposed on the interview by the statutory Welfare Eligibility Rules. We identify some of the pre-structured plans in this constrained conversational domain in our effort to define the range of choices available in a welfare eligibility interview."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "The Composite Decision Process", "Title": "A Unifying Formulation for Heuristic Search, Dynamic Programming and Branch & Bound Procedures +", "Abstract": "In this short paper we present a brief exposition of a composite decision process -- our unifying formulation of search procedures -- which provides new insights concerning the relationships among heuristic search, dynamic programming and branch and bound procedures."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Solving the General Consistent Labeling (or Constraint Satisfaction) Problem", "Title": "Two Algorithms and Their Expected Complexities", "Abstract": "The Consistent Labeling Problem is of considerable importance in Artificial Intelligence, Operations Research and Symbolic Logic. It has received much attention, but most work has addressed the specialized binary form of the problem. Furthermore, none of the relatively few papers that treat the general problem have dealt analytically with the issue of complexity. In this paper we present two algorithms for solving the general Consistent Labeling Problem and for each of these the expected complexity is given under a simple statistical model for the distribution of problems. This model is sufficient to expose certain interesting aspects of complexity for the two algorithms. Work currently in progress will address more subtle aspects by extension to more refined satistical models."}
{"Type": "conference", "Year": "1983", "Area": "AI", "Where": "AAAI", "Abbreviation": "Predicting the Performance of Distributed Knowledge-Based Systems", "Title": "A Modeling Approach", "Abstract": "A model of a distributed knowledge-based system is presented. The model captures the features specific to those systems, such as alternative paths to the solution, utilization of inexact and/or incomplete knowledge and data, dynamic task creation, complex subproblem dependencies and focusing aspect of problem solving. The model is applied to the analysis of communication policies in a distributed interpretation system. The result of the analysis is the best policy for the given environment and system conditions. Another use of the model as a real-time simulation tool is suggested."}
