{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "SWIRL", "Title": "An Object-Oriented Air Battle Simulator", "Abstract": "We describe a program called SWIRL designed for simulating military air battles between offensive and defensive forces. SWIRL is written in an object-oriented language (ROSS) where the knowledge base consists of a set of objects and their associated behaviors. We discuss some of the problems we encountered in designing SWIRL and present our approaches to them."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Knowledge Management", "Title": "A Practical Amalgam of Knowledge and Data Base Technology", "Abstract": "This paper describes the central features of a system designed for the management of large amounts of application specific knowledge. The Knowledge Manager (KM-I) employs distinct software and hardware processors to implement: 1) A file of general knowledge and an associated reasoning engine, and 2) A file of specific knowledge and an associated searching engine. We present our reasons for believing why this can be an effective strategy for realizing many practical knowledge based/expert system applications that lie in a large overlapping area between practical AI and advanced data management technology. We then outline the major features and components of the system and discuss the range of intended applications."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Removing Restrictions in the Relational Data Base Model", "Title": "An Application of Problem Solving Techniques", "Abstract": "The principal restrictions previously placed on the relational data base model have been removed in the L2 model presented here. We extend the model to include null (i.e. unknown and non-relevant) values (even in keys), repetitions of tuples, functional dependencies, a very rich set of constraints and information originating from several sources. The programmed problem-solver ALICE is utilized to manipulate the constraints and to simplify relations: to answer a query, ALICE selects both the tuples which might answer the query upon appropriate substitutions for unknown values."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "RABBIT", "Title": "An Intelligent Database Assistant", "Abstract": "We have designed and implemented an intelligent database assistant to aid the user in formulating a query. The system, named RABBIT, relies upon a new paradigm for retrieval, retrieval by reformulation, based on a psychological theory of human remembering. To make a query, the user interactively constructs a description of his target item(s) by criticizing successive example (and counterexample) instances. One of the key innovations in RABBIT is that instances from the database are presented to the user from a well-defined perspective inferred from the user’s query description and the structure of the knowledge base. Among other things, this constructed perspective prevents the user from creating semantically improper query descriptions. RABBIT particularily facilitates users who approach a database with only a vague idea of what it is that they want and who thus, need to be guided in the (re)formulation of their queries. RABBIT is also of substantial value to casual users who have limited knowledge of a given database or who must deal with a multitude of databases."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Expert Systems", "Title": "A User’s Perspective of Some Current Tools", "Abstract": "The purpose of this paper is to report on one user’s experience with several of the software tools for building an expert system. To the best of the author’s knowledge, this is the first time a number of different expert system building tools have been applied to a single problem by a single analyst. A similar single problem/different tool experiment was performed at the Expert Systems Workshop in 1980, but each tool was used by its own proponents on the given problem."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Plan Recognition Strategies in Student Modeling", "Title": "Prediction and Description", "Abstract": "This paper describes the student modeler of the GUIDON2 tutor, which understands plans by a dual search strategy. It first produces multiple predictions of student behavior by a model-driven simulation of the expert. Focused, data-driven searches then explain incongruities. By supplementing each other, these methods lead to an efficient and robust plan understander for a complex domain."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "SPEX", "Title": "A Second-Generation Experiment Design System", "Abstract": "The design of laboratory experiments is a complex and important scientific task. The MOLGEN project has been developing computer systems for automating the design process in the domain of molecular biology. SPEX is a second-generation system which synthesizes the best ideas of two previous MOLGEN hierarchical planning systems: stepwise refinement of skeletal plans and a layered control structure. It has been tested successfully on several problems in the task domain and promises to serve as a testbed for future work in explanation, experiment debugging, and empirical evaluation of different basic design strategies."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "The CRITTER System", "Title": "Analyzing Digital Circuits by Propagating Behaviors and Specifications", "Abstract": "CRITTER is a system that reasons about digital hardware designs, using a a declarative representation that can represent components and signals at arbitrary levels of abstraction. CRITTER can derive the behaviors of a component’s outputs given the behaviors of the inputs. It can derive the specifications a component’s inputs must meet in order for some given specifications on the outputs to be met, and it can verify that a given signal behavior satisfies a given specification. By combining these operations, it evaluates both the correctness and the robustness of the overall design."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "IDT", "Title": "An Intelligent Diagnostic Tool", "Abstract": "IDT is an intelligent hardware diagnostic tool that has been successfully used to identify faults in PDP 11/03 computers. It selects and executes tests, and interprets the results. IDT is able to modify its test selection strategy on the basis of results of previous tests as well as opinions offered to it by the user. Symbolic formulas are used to represent the relationship between the test results and the broken equipment. If we assume that there is only one broken component, then set operations can be shown to be sufficiently general for combining the results of multiple tests."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "REACTOR", "Title": "An Expert System for Diagnosis and Treatment of Nuclear Reactor Accidents", "Abstract": "REACTOR is an expert system under development at EG&G Idaho, Inc., that will assist operators in the diagnosis and treatment of nuclear reactor accidents. This paper covers the background of the nuclear industry and why expert system technology may prove valuable in the reactor control room. Some of the basic features of the REACTOR system are discussed, and future plans for validation and evaluation of REACTOR are presented. The concept of using both event-oriented and function-oriented strategies for accident diagnosis is discussed. The response tree concept for representing expert knowledge is also introduced."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Induction of Causal Relationships From a Time-Oriented Clinical Database", "Title": "An Overview of the RX Project", "Abstract": "The RX computer program examines a time-oriented clinical database and attempts to derive a set of (possibly) causal relationships. First, a Discovery Module uses lagged, nonparametric correlations to generate an ordered list of tentative relationships. Second, a Study Module uses a small knowledge base (KB) of medicine and statistics to create a study design to control for known confounders. The study design is then executed by an on-line statistical package, and the results are automatically incorporated into the KB as a machine-readable record. In determining the confounders of a new hypothesis the Study Module uses previously \"learned\" causal relationships."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "ARBY", "Title": "Diagnosis with Shallow Causal Models", "Abstract": "Arby is a software system or higher order language for writing expert systems to do diagnosis in electronic systems. As such, it is similar to EMYCIN (Van Melle 1982) in application, but quite different in design. It is rule-based to an extent, but the rules are written in predicate calculus. It resembles Caduceus (Pople 1977) in its mechanisms for refining and combining hypotheses."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Representing Smooth Plane Curves for Recognition", "Title": "Implications for Figure-Ground Reversal", "Abstract": "A representation of smooth plane curves for recognition is proposed. The basic representation is a linked list of four primitive shapes, called \"codons,\" which are invariant under rotations, translations and uniform scaling. Psychophysical observations regarding the perception of figure- ground reversals are presented to suggest that a similar representation could be used by the human visual system."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Why Perspective Is Difficult", "Title": "How Two Algorithms Fail", "Abstract": "Attempting to derive image algorithms solely under orthographic projection is deceptively easy. However, orthographic algorithms often fail when applied to the perspective case. More critically, since many things simplify under orthography, such algorithms often give no evidence for their proper extension. This paper gives two such examples, showing both the problems that arise for them under perspective, and the surprising extensions that they require."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Job-Shop Scheduling", "Title": "An Investigation in Constraint-Directed Reasoning", "Abstract": "This paper describes ISIS-II*, a constraint-directed reasoning system for the scheduling of factory job-shops. ISIS-II takes a heuristic search approach to generating schedules. The key features of ISIS-II’s approach is that it can re- present and use a variety of different types of constraints to guide the search, and is able to selectively relax conflicting constraints."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Heuretics", "Title": "Theoretical and Experimental Study of Heuristic Rules", "Abstract": "Builders of expert rule-based systems [Barr 81] [Feigenbaum 77] [Hayes-Roth et al. 82] attribute the impressive performance of their programs to the corpus of knowledge they embody: a large network of facts to provide breadth of scope, and a large array of informal judgmental rules (heuristics) which guide the system toward plausible paths to follow and away from implausible ones. Yet what is the nature of heuristics? What is the source of their power? How do thev interreIate; i.e., how can/should a large corpus of heuristic rules be organized? How do heuristics originate and evolve? \"Heuretics\" is the study of heuristics, with an eye toward answering questions such as those. Two case studies, the AM and EURISKO programs, have led to some tentative Heuretics hypotheses, a dozen of which are presented in this paper. Our aim is to stimulate future research in this field."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "A Search Procedure for Perfect Information Games of Chance", "Title": "Its Formulation and Analysis", "Abstract": "An algorithm is developed for searching the trees of \"perfect information\" games involving chance events. Many dice games (e.g. backgammon, craps, and monopoly and similar board games), and some card games (e.g. casino blackjack), have this property. For depth 3 trees, empirical observation reveals a search reduction of more than 50 percent, while closed-form analysis reveals a best-case complexity of O(N**2). This represents a substantial savings over the O(N**3) behavior of the \"obvious\" search strategy."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Reverend Bayes on Inference Engines", "Title": "A Distributed Hierarchical Approach", "Abstract": "This paper presents generalizations of Bayes likelihood-ratio updating rule which facilitate an asynchronous propagation of the impacts of new beliefs and/or new evidence in hierarchically organized inference structures with multi-hypotheses variables. The computational scheme proposed specifies a set of belief parameters, communication messages and updating rules which guarantee that the diffusion of updated beliefs is accomplished in a single pass and complies with the tenets of Bayes calculus."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Unifying Data-Directed and Goal-Directed Control", "Title": "An Example and Experiments", "Abstract": "Effective control in a multi-level cooperating knowledge source problem solver (such as Hearsay-II) requires the system to reason about the relationships among competing and cooperating knowledge source (KS) instantiations (both past and potential) that are working on different aspects and levels of the problem. Such reasoning is needed to assess the current state of problem solving and to develop plans for using the system’s limited processing resources to the best advantage. The relationships among KS instantations can be naturally represented when KS activity is viewed simultaneously from a data-directed and a goal-directed perspective. In this paper we show how data- and goal-directed control can be integrated into a single, uniform framework, and we present an example and experimental results of sophisticated focusing using this framework."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Argument Molecules", "Title": "A Functional Representation of Argument Structure", "Abstract": "Understanding an utterance in an argument crucially requires determining the evidential relations it bears to prior and subsequent propositions in the argument (Birnbaum et al., 1980; Cohen, 1981). The memory representation of an argument should, accordingly, indicate which propositions a given proposition counts as evidence for (a support relation) or against (an attack relation), and which propositions support or attack it in turn. The representation of an argument can thus be viewed as a network of propositions connected by support or attack relations (an argument graph). Although this sort of representation can be motivated simply by the need to represent the content of an argument, it seems natural to ask whether such argument graphs might further possess any useful structural properties, abstracted from the specific propositions they relate."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "ARGOT", "Title": "The Rochester Dialogue System", "Abstract": "We are engaged in a long-term research project that has the ultimate aim of describing a mechanism that can partake in an extended English dialogue on some reasonably well specified range of topics. This paper is a progress report on the project, called ARGOT. It outlines the system and describes recent results as well as work in progress."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Conceptual Dependency and Montague Grammar", "Title": "A Step Toward Conciliation", "Abstract": "In attempting to establish a common basis from which the approaches and results can be compared, we have taken a conciliatory attitude toward natural language research in the conceptual dependency (CD) paradigm and Montague Grammar (MG) formalism. Although these two approaches may seem to be strange bedfellows indeed with often noticeably different perspectives, we have observed many commonalities. We begin with a brief description of the problem view and ontology of each and then create a formulation of CD as logic. We then give \"conceptual\" MG translations for the words in an example sentence which we use in approximating a word-based parsing style. Finally, we make some suggestions regarding further extensions of logic to introduce higher level representations."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Talking to UNIX in English", "Title": "An Overview of UC", "Abstract": "UC (UNIX Consultant) is an intelligent natural language interface that allows naive users to communicate with the UNIX** operating system in ordinary English. UC is currently capable of handling simple dialogues..."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Knowledge Representation Languages and Predicate Calculus", "Title": "How to Have Your Cake and Eat It Too", "Abstract": "This paper attempts to resolve some of the controversy between advocates of predicate calcu1us and users of other knowledge representation languages by demonstrating that it is possible to have the key features of both in a hybrid system. An example is given of a recently implemented hybrid system in which a specialized planning language co-exists with its translation into predicate calculus. In this system, various kinds of reasoning required for a program understanding task are implemented at either the predicate calculus level or the planning language level, depending on which is more natural."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "The QBKG System", "Title": "Generating Explanations From a Non-Discrete Knowledge Representation", "Abstract": "The QBKG system produces critical analyses of possible moves for a wide variety of backgammon positions, using a hierarchically structurcd, non-discrete form of knowledge representation. This report compares discrete and continuous representations and reasoning systems, addressing issues of competence, robustness, and explainability. The QBKG system is described and demonstrated."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "PLANT/ds Revisited", "Title": "Non-Homogeneous Evaluation Schema in Expert Systems", "Abstract": "This paper describes several deficiencies of PLANT/ds, an expert system for the diagnosis of soybean diseases. This production system employs both human and machine derived rules. The rule application mechanism for both rule groups suffer from improper treatment of incomplete data. The problem is illustrated by several examples, and a solution is proposed. Implementation of a new version of PLANT on the empty expert system ADVISE is seen as the crux of future research."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "GLISP", "Title": "A High-Level Language for AI Programming", "Abstract": "GLISP is a high-level LISP-based language which is compiled into LISP using a knowledge base of object descriptions. Lisp objects and objects in AI representation languages are treated uniformly; this makes program code independent of the data representation used, and permits changes of representation without changing code. GLISP’s object description language provides a powerful abstract datatype facility which allows the structures and properties of objects to be dcscribcd. Reference to objects is permitted in an English-like syntax, including definite reference relative to the current context of the computation. Object-centered programming is supported. When interfaced to a hierarchical representation language, GLISP can perform inheritance at compile time, resulting in substantial performance improvements. In addition, a LISP structure can be specified as the way of implementing a class of objects in the representation language, making simple objects efficient in both time and storage."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "DADO", "Title": "A Tree-Structured Machine Architecture for Production Systems", "Abstract": "DADO is a parallel tree-structured machine designed to provide highly significant performance improvements in the execution of large Production systems. The DADO machine comprises a large (on the order of a hundred thousand) set of processing elements (PE’s), each containing its own processor, a small amount (2K bytes, in the current design) of local random access memory, and a specialized I/O switch. The PE’s are interconnected to form a complete binary tree. This paper describes a general procedure for the parallel execution of production systems on the DADO machine, and outlines in general terms how this procedure can be extended to include commutative and multiple, independent production systems."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Learning by Chunking", "Title": "Summary of a Task and a Model", "Abstract": "The power law of practice states that performance on a task improves as a power-law function of the number of times the task has been performed. In this article we describe recent work on a model of this effect. The model, called the chunking theory of learning, is based on the notion of chunking. A limited version of this model has been implemented within the Xaps2 production system architecture. When it is applied to a 1023-choice reaction-time task (encoded as a set of productions), task performance is improved (measured in terms of the number of production system cycles). Moreover, the practice curves are power law in form."}
{"Type": "conference", "Year": "1982", "Area": "AI", "Where": "AAAI", "Abbreviation": "Monitors as Responses to Questions", "Title": "Determining Competence", "Abstract": "This paper discusses the application of a propositional temporal logic to determining the competence of a monitor offer as an extended response by a question-answering system. Determining monitor competence involves reasoning about the possibility of some future state given a description of the current state and possible transitions."}
