{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Searching for Stable Mechanisms", "Title": "Automated Design for Imperfect Players", "Abstract": "RecentlyConitzer and Sandholm introduced the concept of \"automated mechanism design\", whereby mechanism design problems are solved using constraint-satisfaction methods. Traditionally, mechanism design has focused on producing games which yield the desired outcomes when played by ideal rational players. However actual players are never perfectly rational --- human irrationality has been exhaustively studied and computational agents have both resource bounds and potentially implementation flaws. In this paper, we discuss extensions of the techniques of automated mechanism design to produce games which are robust in the face of player imperfections. We model limited rationality by examining agents which converge on their strategy by using a simple variant of \"fictitious play\" (simulation of repeated play). This model associates to each game a system of differential equations describing the trajectory of the agent’s strategies. We describe additional constraints which guarantee that automated mechanism design search problems yield stable mechanisms. In particular, we present negative results for structural stability and positive results for asymptotic stability by considering strict Bayesian-Nash equilibria and by employing Lyapunov techniques."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "GROWRANGE", "Title": "Anytime VCG-Based Mechanisms", "Abstract": "We introduce anytime mechanisms for distributed optimization with self-interested agents. Anytime mechanisms retain good incentive properties even when interrupted before the optimal solution is computed, and provide better quality solutions when given additional time. Anytime mechanisms can solve easy instances of a hard problem quickly and optimally, while providing approximate solutions on very hard instances. In a particular instantiation, GROWRANGE, we successively expand the range of outcomes considered, computing the optimal solution for each range. Truth-revelation remains a dominant strategy equilibrium with a stage-based interruption, and is a best-response with high probability when the interruption is time-based."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Useful Roles of Emotions in Artificial Agents", "Title": "A Case Study from Artificial Life", "Abstract": "In this paper, we discuss the role of emotions in AI and possible ways to determine their utility for the design of artificial agents. We propose a research methodology for determining the utility of emotional control and apply it to the study of autonomous agents that compete for resources in an artificial life environment. The results show that the emotional control can improve performance in some circumstances."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "The Backdoor Key", "Title": "A Path to Understanding Problem Hardness", "Abstract": "We introduce our work on the backdoor key, a concept that shows promise for characterizing problem hardness in backtracking search algorithms. The general notion of backdoors was recently introduced to explain the source of heavy-tailed behaviors in backtracking algorithms. We describe empirical studies that show that the key faction,i.e., the ratio of the key size to the corresponding backdoor size, is a good predictor of problem hardness of ensembles and individual instances within an ensemble for structure domains with large key fraction."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Hiding Satisfying Assignments", "Title": "Two Are Better than One", "Abstract": "The evaluation of incomplete satisfiability solvers depends critically on the availability of hard satisfiable instances. A plausible source of such instances are k-CNF formulas whose clauses are chosen uniformly at random among all clauses satisfying some randomly chosen truth assignment A. Unfortunately, instances generated in this manner are relatively easy and can be solved efficiently by practical heuristics. Roughly speaking, as the number of clauses is increased, A acts as a stronger and stronger attractor. Motivated by recent results on the geometry of the space of solutions for random k-SAT and NAE-k-SAT instances, we propose a very simple twist on this model that greatly increases the hardness of the resulting formulas. Namely, in addition to forbidding the clauses violated by the hidden assignment A, we also forbid the clauses violated by its complement, so that both A and the complement of A are satisfying. It appears that under this \"symmetrization\" the effects of the two attractors largely cancel out, making it much harder for an algorithm to \"feel\" (and find) either one. We give theoretical and experimental evidence supporting this assertion."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Modeling Choices in Quasigroup Completion", "Title": "SAT Versus CSP", "Abstract": "We perform a systematic comparison of SAT and CSP models for a challenging combinatorial problem, quasigroup completion (QCP). Our empirical results clearly indicate the superiority of the 3D SAT encoding, with various solvers, over other SAT and CSP models. We propose a partial explanation of the observed performance. Analytically, we focus on the relative conciseness of the 3D model and the pruning power of unit propagation. Empirically, the focus is on the role of the unit-propagation heuristic of the best performing solver, Satz, which proves crucial to its success, and results in a significant improvement in scalability when imported into the CSP solvers. Our results strongly suggest that SAT encodings of permutation problems may well prove quite competitive in other domains, in particular when compared with the currently preferred channeling CSP models."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Leap Before You Look", "Title": "An Effective Strategy in an Oversubscribed Scheduling Problem", "Abstract": "Oversubscribed scheduling problems require removing or partially satisfying tasks when enough resources are not available. For a particular oversubscribed problem, Air Force Satellite Control Network scheduling, we find that the best approaches make long leaps in the search space. We find this is in part due to large plateaus in the search space. Algorithms moving only one task at a time are impractical. Both a genetic algorithm and Squeaky Wheel Optimization (SWO) make long leaps in the search space and produce good solutions almost 100 times faster than local search. Greedy initialization is shown to be critical to good performance, but is not as important as directed leaps. When using fewer than 2000 evaluations, SWO shows superior performance; with 8000 evaluations, a genetic algorithm using a population seeded with greedy solutions further improves on the SWO results."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "QUICKXPLAIN", "Title": "Preferred Explanations and Relaxations for Over-Constrained Problems", "Abstract": "Over-constrained problems can have an exponential number of conflicts, which explain the failure, and an exponential number of relaxations, which restore the consistency. A user of an interactive application, however, desires explanations and relaxations containing the most important constraints. To address this need, we define preferred explanations and relaxations based on user preferences between constraints and we compute them by a generic method which works for arbitrary CP, SAT, or DL solvers. We significantly accelerate the basic method by a divide-and-conquer strategy and thus provide the technological basis for the explanation facility of a principal industrial constraint programming tool, which is, for example, used in numerous configuration applications."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "MAX-2-SAT", "Title": "How Good Is Tabu Search in the Worst-Case?", "Abstract": "Tabu search algorithms are amongst the most successful local search based methods for the maximum satisfiability problem. The practical superiority of tabu search over the local search alone has been already shown experimentally several times. A natural question addressed here is to understand if this superiority holds also from the worst-case point of view. Moreover, it is well known that the main critical parameter of tabu techniques is the tabu list length. Focussing on MAX-2-SAT problem, the main contribution of this paper is a worst-case analysis of tabu search as a function of the tabu list length. We give a first theoretical evidence of the advantage of a tabu search strategy over the basic local search alone that critically depends on the tabu list length."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "CASEE", "Title": "A Hierarchical Event Representation for the Analysis of Videos", "Abstract": "A representational gap exists between low-level measurements (segmentation, object classification, tracking) and high-level understanding of video sequences. In this paper, we propose a novel representation of events in videos to bridge this gap, based on the CASE representation of natural languages. The proposed representation has three significant contributions over existing frameworks. First, we recognize the importance of causal and temporal relationships between sub-events and extend CASE to allow the representation of temporal structure and causality between sub-events. Second, in order to capture both multi-agent and multi-threaded events, we introduce a hierarchical CASE representation of events in terms of sub-events and case-lists. Last, for purposes of implementation we present the concept of a temporal event-tree, and pose the problem of event detection as subtree pattern matching. By extending CASE, a natural language representation, for the representation of events, the proposed work allows a plausible means of interface between users and the computer. We show two important applications of the proposed event representation for the automated annotation of standard meeting video sequences, and for event detection in extended videos of railroad crossings."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Logical Foundations of Negotiation", "Title": "Outcome, Concession, and Adaptation", "Abstract": "This paper provides a logical framework for negotiation between agents that are assumed to be rational, cooperative and truthful. We present a characterisation of the permissible outcomes of a process of negotiation in terms of a set of rationality postulates, as well as a method for constructing exactly the rational outcomes. The framework is extended by describing two modes of negotiation from which an outcome can be reached. In the concessionary mode, agents are required to weaken their demands in order to accommodate the demands of others. In the adaptationist mode, agents are required to adapt to the demands of others in some appropriate fashion. Both concession and adaptation are characterised in terms of rationality postulates. We also provide methods for constructing exactly the rational concessions, as well as the rational adaptations. The central result of the paper is the observation that the outcomes obtained from the concessionary and adaptationist modes both correspond to the rational outcomes. We conclude by pointing out the links between negotiation and AGM belief change, and providing a glimpse of how this may be used to define a notion of preference-based negotiation."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Methods for Domain-Independent Information Extraction from the Web", "Title": "An Experimental Comparison", "Abstract": "Our KNOWITALL system aims to automate the tedious process of extracting large collections of facts (e.g., names of scientists or politicians) from the Web in an autonomous, domain-independent, and scalable manner. In its first major run, KNOWITALL extracted over 50,000 facts with high precision, but suggested a challenge: How can we improve KNOWITALL’s recall and extraction rate without sacrificing precision? This paper presents three distinct ways to address this challenge and evaluates their performance. Rule Learning learns domain-specific extraction rules. Subclass Extraction automatically identifies sub-classes in order to boost recall. List Extraction locates lists of class instances, learns a “wrapper” for each list, and extracts elements of each list. Since each method bootstraps from KNOWITALL’s domain-independent methods, no hand-labeled training examples are required. Experiments show the relative coverage of each method and demonstrate their synergy. In concert, our methods gave KNOWITALL a 4-fold to 19-fold increase in recall, while maintaining high precision, and discovered 10,300 cities missing from the Tipster Gazetteer."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Identification and Tracing of Ambiguous Names", "Title": "Discriminative and Generative Approaches", "Abstract": "A given entity — representing a person, a location or an organization — may be mentioned in text in multiple, ambiguous ways. Understanding natural language requires identifying whether different mentions of a name, within and across documents, represent the same entity. We present two machine learning approaches to this problem, which we call the \"Robust Reading\" problem. Our first approach is a discriminative approach, trained in a supervised way. Our second approach is a generative model, at the heart of which is a view on how documents are generated and how names (of different entity types) are \"sprinkled\" into them. In its most general form, our model assumes: (1) a joint distribution over entities (e.g., a document that mentions President Kennedy is more likely to mention Oswald or White House than Roger Clemens), (2) an author model, that assumes that at least one mention of an entity in a document is easily identifiable, and then generates other mentions via (3) an appearance model, governing how mentions are transformed from the representative mention. We show that both approaches perform very accurately, in the range of $90%-95% F"}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Shortest Path Discovery Problems", "Title": "A Framework, Algorithms and Experimental Results", "Abstract": "In this paper we introduce and study Shortest Path Discovery (SPD) problems, a generalization of shortest path problems: In SPD one is given a directed edgeweighted graph and the task is to find a the shortest path for fixed source and target nodes such that initially the edge-weights are unknown, but they can be queried. Querying the cost of an edge is expensive and hence the goal is to minimize the total number of edge cost queries executed. In this article we characterize some common properties of sound SPD algorithms, propose a particular algorithm that is shown to be sound and effective. Experimental results on real-world OCR task demonstrate the usefulness of the approach whereas the proposed algorithm is shown to yield a substantial speed-up of the recognition process."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Branching and Pruning", "Title": "An Optimal Temporal POCL Planner Based on Constraint Programming", "Abstract": "A key feature of modern optimal planners such as Graphplan and Blackbox is their ability to prune large parts of the search space. Previous Partial Order Causal Link (POCL) planners provide an alternative branching scheme but lacking comparable pruning mechanisms do not perform as well. In this paper, a domain-independent formulation of temporal planning based on Constraint Programming is introduced that successfully combines a POCL branching scheme with powerful and sound pruning rules. The key novelty in the formulation is the ability to reason about supports, precedences, and causal links involving actions that are not in the plan. Experiments over a wide range of benchmarks show that the resulting optimal temporal planner is much faster than current ones and is competitive with the best parallel planners in the special case in which actions have all the same duration."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Advice Generation from Observed Execution", "Title": "Abstract Markov Decision Process Learning", "Abstract": "An advising agent, a coach, provides advice to other agents about how to act. In this paper we contribute an advice generation method using observations of agents acting in an environment. Given an abstract state definition and partially specified abstract actions, the algorithm extracts a Markov Chain, infers a Markov Decision Process, and then solves the MDP (given an arbitrary reward signal) to generate advice. We evaluate our work in a simulated robot soccer environment and experimental results show improved agent performance when using the advice generated from the MDP for both a sub-task and the full soccer game."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Towards Efficient Sampling", "Title": "Exploiting Random Walk Strategies", "Abstract": "From a computational perspective, there is a close connection between various probabilistic reasoning tasks and the problem of counting or sampling satisfying assignments of a propositional theory. We consider the question of whether state-of-the-art satisfiability procedures, based on random walk strategies, can be used to sample uniformly or nearuniformly from the space of satisfying assignments. We first show that random walk SAT procedures often do reach the full set of solutions of complex logical theories. Moreover, by interleaving random walk steps with Metropolis transitions, we also show how the sampling becomes near-uniform."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "mCP Nets", "Title": "Representing and Reasoning with Preferences of Multiple Agents", "Abstract": "We introduce mCP nets, an extension of the CP net formalism to model and handle the qualitative and conditional preferences of multiple agents. We give a number of different semantics for reasoning with mCP nets. The semantics are all based on the idea of individual agents voting. We describe how to test optimality and preference ordering within a mCP net, and we give complexity results for such tasks. We also discuss whether the voting schemes fairly combine together the preferences of the individual agents."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "PROBCONS", "Title": "Probabilistic Consistency-Based Multiple Alignment of Amino Acid Sequences", "Abstract": "Obtaining an accurate multiple alignment of protein sequences is a difficult computational problem for which many heuristic techniques sacrifice optimality to achieve reasonable running times. The most commonly used heuristic is progressive alignment, which merges sequences into a multiple alignment by pairwise comparisons along the nodes of a guide tree. To improve accuracy, consistency-based methods take advantage of conservation across many sequences to provide a stronger signal for pairwise comparisons. In this paper, we introduce the concept of probabilistic consistency for multiple sequence alignments. We also present PROBCONS, an HMM-based protein multiple sequence aligner, based on an approximation of the probabilistic consistency objective function. On the BAliBASE benchmark alignment database, PROBCONS demonstrates a statistically significant improvement in accuracy compared to several leading alignment programs while maintaining practical running times."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Knowledge State Reconsideration", "Title": "Hindsight Belief Revision", "Abstract": "As a knowledge representation and reasoning (KRR) system gathers and reasons about information, it has to update its belief space to maintain consistency. Some belief change operations it can perform include expansion (addition with no consistency checking), contraction (aka removal or retraction), revision (consistent prioritized addition), and consolidation (elimination of any and all inconsistencies). Whether belief change operations are performed on theories or bases, with ideal agents or those that are resource-bounded, there is no doubt that the order of operations typically affects the makeup of the resulting belief base. If a KRR system gains new information that, in hindsight, might have altered the outcome of an earlier belief change decision, the earlier decision should be re-examined. We call this operation reconsideration, and the result is an optimal belief base regardless of the order of previous belief change operations."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "iBundler", "Title": "An Agent-Based Decision Support Service for Combinatorial Negotiations", "Abstract": "Negotiation events in industrial procurement involving multiple, highly customisable goods pose serious challenges to buying agents when trying to determine the best set of providing agents’ offers. Typically, a buying agent’s decision involves a large variety of constraints that may involve attributes of a very same item as well as attributes of multiple items. In this paper we describe iBundler, an agent-aware negotiation service to solve the winner determination problem considering buyers’ and providers’ constraints and preferences."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "CMRadar", "Title": "A Personal Assistant Agent for Calendar Management", "Abstract": "One of the more compelling visions for agents research is the development of “personal assistant agents” that are tasked with making people and organizations more efficient by autonomously handling routine tasks on behalf of their users. Most recently, several researchers including ourselves have embarked on a large research project, called The Radar Project, whose overall goal is to develop a personalized agent that is able to assist its user in a wide range of everyday tasks. Within this larger project, we are concerned with the more focused task of managing a user’s calendar. While isolated aspects of calendar management have been investigated before, in this paper, we present CMRadar, a complete agent with capabilities ranging across the full spectrum of calendar management, from natural language processing of incoming scheduling-related emails, to making autonomous scheduling decisions, to negotiating with other users, to user interfacing and visualization. Although many research issues remain, we believe CMRadar is the first end-to-end agent for automated calendar management."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Centibots", "Title": "Very Large Scale Distributed Robotic Teams", "Abstract": "In this paper, we describe the development of Centibots, a framework for very large teams of robots that are able to perceive, explore, plan and collaborate in unknown environments. Teams consist of approximately 100 robots which can be deployed in unexplored areas and which can efficiently distribute tasks among themselves; the system also makes use of a mixed initiative mode of interaction in which a user can easily influence missions as necessary. In contrast to simulation-based systems which abstract away aspects of the environment for examining component technologies, our design reflects an integrated, end-to-end system.\nFex"}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "WordNet", "Title": ":Similarity — Measuring the Relatedness of Concepts", "Abstract": "WordNet::Similarity is a freely available software package that makes it possible to measure the semantic similarity or relatedness between a pair of concepts (or word senses). It provides six measures of similarity, and three measures of relatedness, all of which are based on the lexical database WordNet. These measures are implemented as Perl modules which take as input two concepts, and return a numeric value that represents the degree to which they are similar or related."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "PRECISE on ATIS", "Title": "Semantic Tractability and Experimental Results", "Abstract": "The need for Natural Language Interfaces to databases (NLIs) has become increasingly acute as more and more people access information through their web browsers, PDAs, and cell phones. Yet NLIs are only usable if they map natural language questions to SQL queries correctly — people are unwilling to trade reliable and predictable user interfaces for intelligent but unreliable ones. We describe a reliable NLI, PRECISE, that incorporates a modern statistical paser and a semantic module. PRECISE provably handles a large class of natural language questions correctly. On the benchmark ATIS data set, PRECISE achieves 93.8% accuracy."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "SEM-Ether", "Title": "Semantic Web Based Pervasive Computing Framework — Integrating Web, Devices and People", "Abstract": "Pervasive computing aims to build an aggregated environment around a user by knitting diverse computing and communicating devices and software services into a single homogeneous unit. Our work is to develop a Pervasive computing framework which harnesses the power of Semantic Web and Web Services, facilitating the development of effective and intelligent Pervasive environments. This paper presents a high level view of the framework and how different Pervasive services can be built on this framework"}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "CAMEO", "Title": "Modeling Human Activity in Formal Meeting Situations", "Abstract": "We present CAMEO, the Camera Assisted Meeting Event Observer, which is a physical awareness system designed for use by an agent-based electronic assistant. CAMEO is used to observe formal meeting environments and infer the activities of people attending them."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "SCoT", "Title": "A Spoken Conversational Tutor", "Abstract": "We describe SCoT, a Spoken Conversational Tutor, which has been implemented in order to investigate the advantages of natural language in tutoring, especially spoken language. SCoT uses a generic architecture for conversational intelligence which has capabilities such as turn management and coordination of multi-modal input and output. SCoT also includes a set of domain independent tutorial recipes, a domain specific production-rule knowledge base, and many natural language components including a bi-directional grammar, a speech recognizer, and a text-to-speech synthesizer. SCoT leads a reflective tutorial discussion based on the details of a problem solving session with a real-time Navy shipboard damage control simulator. The tutor attempts to identify and remediate gaps in the student’s understanding of damage control doctrine by decomposing its tutorial goals into dialogue acts, which are then acted on by the dialogue manager to facilitate the conversation."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Responsive Information Architect", "Title": "A Context-Sensitive Multimedia Conversation Framework for Information Seeking", "Abstract": "We are building a context-sensitive framework, called Responsive Information Architect (RIA), which engages users in automatically generated multimedia conversations. Unlike existing information browsing paradigm that forces users to explore information following pre-defined paths (e.g., GUI menus), RIA allows users to express their information requests flexibly using a mixture of input modalities, including speech, text, and gesture. Using a rich context, such as conversation history and data semantics, RIA is capable of understanding user inputs, including these complex data queries."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Intelligent Systems Demonstration", "Title": "The Secure Wireless Agent Testbed (SWAT)", "Abstract": "We will demonstrate the Secure Wireless Agent Testbed (SWAT), a unique facility developed at Drexel University to study integration, networking and information assurance for next-generation wireless mobile agent systems. SWAT is an implemented system that fully integrates: (1) mobile agents, (2) wireless ad hoc multi-hop networks, and (3) security. The demonstration will show the functionality of a number of decentralized agent-based applications, including applications for authentication, collaboration, messaging, and remote sensor monitoring. The demonstration will take place on a live mobile ad hoc network consisting of approximately a dozen nodes (PDAs, tablet PCs, and laptops) and hundreds of mobile software agents."}
{"Type": "conference", "Year": "2004", "Area": "AI", "Where": "AAAI", "Abbreviation": "Multi-Agent System Development", "Title": "Design, Runtime, and Analysis", "Abstract": "Dynamic and unexpected events are defining characteristics of numerous application domains. These environments often require decision-makers to solve many problems with insufficient time and resources. To effectively assess options, decision-makers require situation analysis and decision-support tools that model the dynamism of these environments to make rapid, robust decisions. Autonomous agents and multi-agent systems satisfy these requirements for decision-making in dynamic environments. Developing a multi-agent system (MAS) is a challenging task, considering sophisticated agent interactions and uncertain environmental dynamics and domain requirements. This demonstration addresses the comprehensive development process for multi-agent systems; illustrating tools for the initial design of the agent system, the capabilities encoded in the individual agents, and analysis tools that enhance developer comprehension of system behavior."}
