{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Diagnosing Circuits With State", "Title": "An Inherently Underconstrained Problem", "Abstract": "Hard problems can be hard because they are computationally intractable, or because they are underconstrained. Here we describe candidate generation for digital devices with state, a fault localization problem that is intractable when the devices are described at low levels of abstraction, and is underconstrained when described at higher levels of abstraction. Previous work [l] has shown that a fault in a combinatorial digital circuit can be localized using a constraint-based representation of structure and behavior. ln this paper we (1) extend this representation to model a circuit with state by choosing a time granularity and vocabulary of signals appropriate to that circuit; (2) demonstrate that the same candidate generation procedure that works for combinatorial circuits becomes indiscriminate when applied to a state circuit modeled in that extended representation;(3) show how the common technique of single-stepping can be viewed as a divide-and-conquer approach to overcoming that lack of constraint; and (4) illustrate how using structural detail can help to make the candidate generator discriminating once again, but only at great cost."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Constraint-Based Generalization", "Title": "LeaMing Game-Playing Plans from Single Examples", "Abstract": "Constraint-based Generalization is a technique for deducing generalizations from a single example. We show how this technique can be used for learning tactical combinations in games and discuss an implementation which learns forced wins in tic-tat-toe, go-moku, and chess."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Constraint Limited Generalization", "Title": "Acquiring Procedures from Examples", "Abstract": "Generallzatlon is an essential part of any system that can acquire knowledge from examples. l argue that generallzatlon must be limited by a variety of constraints in order to be useful. This paper gives three principles on how generallzation processes should be constrained. It also describes a system for acquiring procedures from examples which is based on these principles and is used to illustrate them."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Path Relaxation", "Title": "Path Planning for a Mobile Robot", "Abstract": "Path Relaxation is a method of planning safe paths around obstacles for mobile robots. It works in two steps: a global grid starch that finds a rough path, followed by a local relaxation step that adjusts each node on the path to lower the overall path cost. The representation used by Path Relaxation allows an explicit tradeoff among length of path, clearance away from obstacles, and distance traveled through unmapped areas."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "YES/MVS", "Title": "A Continuous Real Time Expert System", "Abstract": "YES/MVS (Yorktown Expert System for MVS operators) is a continuous, real time expert system that exerts interactive control over an operating system as an aid to computer operators. This paper discusses the YES/MVS system, its domain of application, and issues that arise in the design and development of an expert system that runs continuously in real time."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Constraint Equations", "Title": "A Concise Compilable Representation for Quantified Constraints in Semantic Networks", "Abstract": "Constraint Equations provide a concise declarative language for expressing semantic constraints that require consistency among several relations. The constraints provide a natural addition to semantic networks, as shown by an extension to the KL-ONE/NIKL representation language. The Equations have a more natural and perspicuous structure than the predicate calculus formulas into which they may be translated, and they also have an executable interpretation. Both universal and existential quantifiers are expressible conveniently in Constraint Equations, as are cardinality quantifiers and transitive closure. For a subclass of these constraints, a prototype compiler automatically generates programs which will enforce these constraints and perform the actions needed to reestablish consistency."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Referential Determinism and Computational Efficiency", "Title": "Posting Constraints from Deep Structure", "Abstract": "Most transformational linguists would no longer create explicit deep structures. Instead they adopt a surface-interpretive approach. We find deep structures indispensable for projection into a semantic network. In conjunction with a reference architecture based on constraint-posting, they minimize referential non-determinisms. We extend Marcus’ Determinism Hypothesis to include immediate reference, a foundational subc!ass of reference. This Referential Determinism Hypothesis, constitutes a semantic constraint on theories of syntactic analysis, arguing for theories that minimize referential non-determinism. We show that our combination of deep structures and constraint-posting eliminates non-determinism in immediate reference. We conclude that constraint-posting, deep-structure parsers satisfy the referential determinism hypothesis."}
{"Type": "conference", "Year": "1984", "Area": "AI", "Where": "AAAI", "Abbreviation": "Living Up To Expectations", "Title": "Computing Expert Responses", "Abstract": "In cooperative man-machine interaction, it is necessary but not sufficient for a system to respond truthfully and informatively to a user’s question. In particular, if the system has reason to believe that its planned response might mislead the user, then it must block that conclusion by modifying its response. This paper focusses on identifying and avoiding potentially misleading responses by acknowledging types of \"informing behavior\" usually expected of an expert. We attempt to give a formal account of several types of assertions that should be included in response to questions concerning the achievement of some goal (in addition to the simple answer), lest the questioner otherwise be misled."}
