{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Catoms", "Title": "Moving Robots Without Moving Parts", "Abstract": "We demonstrate modular robot prototypes developed as part of the Claytronics Project. Among the novel features of these robots (\"catoms\") is their ability to reconfigure (move) relative to one another without moving parts. The absence of moving parts is central to one key aim of our work, namely, plausible manufacturability at smaller and smaller physical scales using high-volume, low-unit-cost techniques such as batch photolithography, multi-material submicron 3D lithographic processing, and self assembly. Claytronics envisions multi-million-module robot ensembles able to form into three dimensional scenes, eventually with sufficient fidelity so as to convince a human observer the scenes are real. This work presents substantial challenges in mechanical and electronic design, control, programming, reliability, power delivery, and motion planning (among other areas), and holds the promise of radically altering the relationship between computation, humans, and the physical world."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Indoor Aerial Robot Competition", "Title": "Challenges in Search and Rescue Applications", "Abstract": "Tasks like bomb-detection, search-and-rescue, and reconnaissance in near-Earth environments are time, cost and labor intensive. Aerial robots could assist in such missions and offset the demand in resources and personnel. However, flying in environments rich with obstacles presents many more challenges which have yet to be identified. For example, telephone wire is one obstacle that is known to be hard to detect in mid-flight. This paper describes how a blimp can be used in an aerial robot competition to identify other key challenges when flying in these cluttered environments."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "NavBot", "Title": "The Navigational Search-and-Rescue Robot", "Abstract": "The Stony Brook Robot Design Team has focused on two main areas of research in the creation of NavBot, our new robot created for the American Association of Artificial Intelligence’s (AAAI) Scavenger Hunt Event: navigation and computer vision. The purpose is to create an intelligent machine that is able to navigate the conference floor for specific objects at the AAAI Conference in Pittsburgh, Pennsylvania."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Pyro", "Title": "An Integrated Environment for Robotics Education", "Abstract": "Pyro, which stands for Python Robotics, is a Python-based robotics programming environment that enables students to explore topics in robotics. Programming robot behaviors in Pyro is akin to programming in a high-level general purpose programming language; Pyro provides abstractions for low-level robot-specific features much like the abstractions provided in high-level programming languages. Consequently, robot control programs written for a small robot (such as K-Team’s hockey puck sized, infrared-based Khepera robot) can be used, without any modifications, to control a much larger robot (such as ActivMedia’s human-scale, laser-based PeopleBot). This represents an advance over previous robot programming methodologies in which robot programs were written for specific motor controllers, sensors, communications protocols and other low-level features. Programming robot behaviors is carried out using the programming language Python, which enables several additional pedagogical benefits. We have developed an extensive set of robot programming modules, modeling techniques, and learning materials that can be used in graduate and undergraduate curricula in a variety of ways."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Social Tag", "Title": "Finding the Person with the Pink Hat", "Abstract": "At the AAAI 2005 Robot Exhibition, the robot GRACE (Graduate Robot Attending a ConferencE) will be playing a game that involves human-robot social interaction, navigation, and interface design. The task is for Grace to locate and rendezvous with one of our team members, who will be wearing a pink hat. The game can be seen as a social version of \"tag\" or \"Marco Polo,\" where the the robot finds the target not through the modalities of sight or sound, but rather through social interactions with strangers in the environment. The task has four phases, which are repeated until the pink hat is located visually: Identification of approachable humans, approach toward a human with whom the robot would like to interact, asking for directions to the person with the pink hat, and following those directions."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Tekkotsu", "Title": "A Framework for AIBO Cognitive Robotics", "Abstract": "Tekkotsu (the name means \"framework\" in Japanese; see www.Tekkotsu.org) is an application development framework for the Sony AIBO robot dog. Over the last two years we have been developing a new layer of Tekkotsu to support an approach to robot programming that we call \"cognitive robotics\". The idea is to provide a set of higher level primitives for perception and action, inspired by ideas from cognitive science, so that programmers can construct intelligent behaviors at a much more abstract level. Three components of our approach are described here: visual routines, dual-coding representations, and perceivable affordances."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "OAR", "Title": "A Formal Framework for Multi-Agent Negotiation", "Abstract": "In Multi-Agent systems, agents often need to make decisions about how to interact with each other when negotiating over task allocation. In this paper, we present OAR, a formal framework to address the question of how the agents should interact in an evolving environment in order to achieve their different goals. The traditional categorization of self-interested and cooperative agents is unified by adopting a utility view. We illustrate mathematically that the degree of cooperativeness of an agent and the degree of its self-directness are not directly related. We also show how OAR can be used to evaluate different negotiation strategies and to develop distributed mechanisms that optimize the performance dynamically. This research demonstrates that sophisticated probabilistic modeling can be used to understand the behaviors of a system with complex agent interactions."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Stable Service Placement on Dynamic Peer-to-Peer Networks", "Title": "A Heuristic for the Distributed k-Center Problem", "Abstract": "The proliferation of wireless networks has underscored the need for systems capable of coping with sporadic network connectivity. The restriction of communication to neighboring hosts makes determining the global state especially difficult, if not impractical. This paper addresses the problem of coordinating the positions of an arbitrary number of services, encapsulated by mobile agents, in a dynamic peer-to-peer network. The agents’ collective goal is to minimize the distance between hosts and services, even if the topology is changing constantly. We propose a distributed algorithm to efficiently calculate the stationary distribution of the network. This can be used as a hill climbing heuristic for agents to find near-optimal locations at which to provide services. Finally, we show that the agent-based hill climbing approach is temporally-stable relative to the instantaneous optimum."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Anyone but Him", "Title": "The Complexity of Precluding an Alternative", "Abstract": "Preference aggregation in a multiagent setting is a central issue in both human and computer contexts. In this paper, we study in terms of complexity the vulnerability of preference aggregation to destructive control. That is, we study the ability of an election’s chair to, through such mechanisms as voter/candidate addition/suppression/partition, ensure that a particular candidate (equivalently, alternative) does not win. And we study the extent to which election systems can make it impossible, or computationally costly (NP-complete), for the chair to execute such control. Among the systems we study---plurality, Condorcet, and approval voting---we find cases where systems immune or computationally resistant to a chair choosing the winner nonetheless are vulnerable to the chair blocking a victory. Beyond that, we see that among our studied systems no one system offers the best protection against destructive control. Rather, the choice of a preference aggregation system will depend closely on which types of control one wishes to be protected against. We also find concrete cases where the complexity of or susceptibility to control varies dramatically based on the choice among natural tie-handling rules."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Controversial Users Demand Local Trust Metrics", "Title": "An Experimental Study on Epinions.com Community", "Abstract": "In today’s connected world it is possible and very common to interact with unknown people, whose reliability is unknown. Trust Metrics are a recently proposed technique for answering questions such as \"Should I trust this user?\". However, most of the current research assumes that every user has a global quality score and that the goal of the technique is just to predict this correct value. We show, on data from a real and large user community, Epinions.com, that such an assumption is not realistic because there is a significant portion of what we call controversial users, users who are trusted and distrusted by many. A global agreement about the trustworthiness value of these users cannot exist. We argue, using computational experiments, that the existence of controversial users (a normal phenomena in societies) demands Local Trust Metrics, techniques able to predict the trustworthiness of an user in a personalized way, depending on the very personal view of the judging user."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Networked Distributed POMDPs", "Title": "A Synthesis of Distributed Constraint Optimization and POMDPs", "Abstract": "In many real-world multiagent applications such as distributed sensor nets, a network of agents is formed based on each agent’s limited interactions with a small number of neighbors. While distributed POMDPs capture the real-world uncertainty in multiagent domains, they fail to exploit such locality of interaction. Distributed constraint optimization (DCOP) captures the locality of interaction but fails to capture planning under uncertainty. This paper present a new model synthesized from distributed POMDPs and DCOPs, called Networked Distributed POMDPs (ND-POMDPs). Exploiting network structure enables us to present two novel algorithms for ND-POMDPs: a distributed policy generation algorithm that performs local search and a systematic policy search that is guaranteed to reach the global optimal."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Axiom Schemata as Metalevel Axioms", "Title": "Model Theory", "Abstract": "Logicians frequently use axiom schemata to encode (potentially infinite) sets of sentences with particular syntactic form. In this paper we examine a first-order language in which it is possible to write expressions that both describe sentences and assert the truth of the sentences so described. The effect of adding such expressions to a knowledge base is the same as directly including the set of described sentences."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Recommender Systems", "Title": "Attack Types and Strategies", "Abstract": "In the research to date, the performance of recommender systems has been extensively evaluated across various dimensions. Increasingly, the issue of robustness against malicious attack is receiving attention from the research community. In previous work, we have shown that knowledge of certain domain statistics is sufficient to allow successful attacks to be mounted against recommender systems. In this paper, we examine the extent of domain knowledge that is actually required and find that, even when little such knowledge is known, it remains possible to mount successful attacks."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "DC-SSAT", "Title": "A Divide-and-Conquer Approach to Solving Stochastic Satisfiability Problems Efficiently", "Abstract": "We present DC-SSAT, a sound and complete divide-and-conquer algorithm for solving stochastic satisfiability (SSAT) problems that outperforms the best existing algorithm for solving such problems (ZANDER) by several orders of magnitude with respect to both time and space. DC-SSAT achieves this performance by dividing the SSAT problem into subproblems based on the structure of the original instance, caching the viable partial assignments (VPAs) generated by solving these subproblems, and using these VPAs to construct the solution to the original problem. DC-SSAT does not save redundant VPAs and each VPA saved is necessary to construct the solution. Furthermore, DC-SSAT builds a solution that is already human-comprehensible, allowing it to avoid the costly solution rebuilding phase in ZANDER. As a result, DC-SSAT is able to solve problems using, typically, 1-2 orders of magnitude less space than ZANDER, allowing DC-SSAT to solve problems ZANDER cannot solve due to space constraints. And, in spite of its more parsimonious use of space, DC-SSAT is typically 1-2 orders of magnitude faster than ZANDER. We describe the DC-SSAT algorithm and present empirical results comparing its performance to that of ZANDER on a set of SSAT problems."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "SymChaff", "Title": "A Structure-Aware Satisfiability Solver", "Abstract": "We present a novel low-overhead framework for encoding and utilizing structural symmetry in propositional satisfiability algorithms (SAT solvers). We use the notion of complete multi-class symmetry and demonstrate the efficacy of our technique through a solver SymChaff that achieves exponential speedup by using simple tags in the specification of problems from both theory and practice. Efficient implementations of DPLL-based SAT solvers are routinely used in areas as diverse as planning, scheduling, design automation, model checking, verification, testing, and algebra. A natural feature of many application domains is the presence of symmetry, such as that amongst all trucks at a certain location in logistics planning and all wires connecting two switch boxes in an FPGA circuit. Many of these problems turn out to have a concise description in many-sorted first order logic. This description can be easily specified by the problem designer and almost as easily inferred automatically. SymChaff, an extension of the popular SAT solver zChaff, uses information obtained from the \"sorts\" in the first order logic constraints to create symmetry sets that are used to partition variables into classes and to maintain and utilize symmetry information dynamically. Current approaches designed to handle symmetry include: (A) symmetry breaking predicates (SBPs), (B) pseudo-Boolean solvers with implicit representation for counting, (C) modifications of DPLL that handle symmetry dynamically, and (D) techniques based on ZBDDs. SBPs are prohibitively many, often large, and expensive to compute for problems such as the ones we report experimental results for. Pseudo-Boolean solvers are provably exponentially slow in certain symmetric situations and their implicit counting representation is not always appropriate. Suggested modifications of DPLL either work on limited global symmetry and are difficult to extend, or involve expensive algebraic group computations. Finally, techniques based on ZBDDs often do not compare well even with ordinary DPLL-based solvers. SymChaff addresses and overcomes most of these limitations."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "CSP Properties for Quantified Constraints", "Title": "Definitions and Complexity", "Abstract": "Quantified constraints and Quantified Boolean Formulae are typically much more difficult to reason with than classical constraints, because quantifier alternation makes the simple, classical notion of solution inappropriate. As a consequence, even such essential CSP properties as consistency or substitutability are not completely understood in the quantified case. In this paper, we show that most of the properties which are used by solvers for CSP can be generalized to Quantified CSP. We propose a systematic study of the relations which hold between these properties, as well as complexity results regarding the decision of these properties. Finally, and since these problems are typically intractable, we generalise the approach used in CSP and propose weakenings of these notions based on locality, which allow for a tractable, albeit incomplete detecting of these properties."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Fast and Compact", "Title": "On A Simple Class of Congestion Games", "Abstract": "We study a simple, yet rich subclass of congestion games that we call singleton games. These games are exponentially more compact than general congestion games. In contrast with some other compact subclasses, we show tractability of many natural game-theoretic questions, such as finding a sample or optimal Nash equilibrium. For best- and better-response dynamics, we establish polynomial upper and lower bounds on the rate of convergence and present experimental results. We also consider a natural generalization of singleton games and show that many tractability results carry over."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "On the Evaluation of Dynamic Critiquing", "Title": "A Large-Scale User Study", "Abstract": "Critiquing is an important form of feedback in conversational recommender systems. However, in these systems the user is usually limited to critiquing a single product feature at a time. Recently"}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Optimal Recommendation Sets", "Title": "Covering Uncertainty over User Preferences", "Abstract": "We propose an approach to recommendation systems that optimizes over possible sets of recommended alternatives in a decision-theoretic manner. Our approach selects the alternative set that maximizes the expected valuation of the user’s choice from the recommended set. The set-based optimization explicitly recognizes the opportunity for passing residual uncertainty about preferences back to the user to resolve. Implicitly, the approach chooses a set with a diversity of alternatives that optimally covers the uncertainty over possible user preferences. The approach can be used with several preference representations, including utility theory, qualitative preferences models, and informal scoring. We develop a specific formulation for multi-attribute utility theory, which we call maximization of expected max (MEM). We go on to show that this optimization is NP-complete (when user preferences are described by discrete distributions) and suggest two efficient methods for approximating it. These approximations have complexity of the same order as the traditional k-max operator and, for both synthetic and real-world data, perform better than the approach of recommending the k-individually best alternatives (which is not a surprise) and very close to the optimum set (which is less expected)."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Issues in Reasoning about Interaction Networks in Cells", "Title": "Necessity of Event Ordering Knowledge", "Abstract": "In this paper we discuss several representation issues that we came across while modelling molecular interactions in cells of living organisms. One of the issues was that the triggering of events inside cells, an important modelling component, are not necessarily immediate, leading to multiple evolution models in the absence of additional information. Second, often an action or a trigger at one level of granularity of representation can be elaborated and refined. We show the problem that existing representation and modelling formalisms have in dealing with the above issues. We then present an action language which builds up on a previous language, and has the ability to express event ordering knowledge. We show that our language is able to adequately address the above-mentioned issues."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Integrating Description Logics and Action Formalisms", "Title": "First Results", "Abstract": "We propose an action formalism that is based on description logics (DLs) and may be viewed as an instance of the Situation Calculus (SitCalc). In particular, description logic concepts can be used for describing the state of the world, and the pre- and post-conditions of actions. The main advantage of such a combination is that, on the one hand, the expressive power for describing world states and conditions is higher than in other decidable fragments of the SitCalc, which are usually propositional. On the other hand, in contrast to the full SitCalc, effective reasoning is still possible. In this paper, we perform a detailed investigation of how the choice of the DL influences the complexity of the standard reasoning tasks executability and projection in the corresponding action formalism. We also discuss semantic and computational problems in natural extensions of our framework."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "DL-Lite", "Title": "Tractable Description Logics for Ontologies", "Abstract": "We propose a new Description Logic, called"}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "DD-PREF", "Title": "A Language for Expressing Preferences over Sets", "Abstract": "In many application domains, it is useful to be able to represent and reason about a user’s preferences over sets of objects. We present a representation language, DD-PREF (for Diversity and Depth PREFerences), for specifying the desired diversity and depth of sets of objects where each object is represented as a vector of feature values. A strong"}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Only-Knowing", "Title": "Taking It Beyond Autoepistemic Reasoning", "Abstract": "The idea of only-knowing a collection of sentences has been previously shown to have a close connection with autoepistemic logic. Here we propose a more general account of only-knowing that captures not only autoepistemic logic but default logic as well. This allows us not only to study the properties of default logic in terms of an underlying model of belief, but also the relationship among different forms of nonmonotonic reasoning, all within a classical monotonic logic characterized semantically in terms of possible worlds."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Strong and Uniform Equivalence in Answer-Set Programming", "Title": "Characterizations and Complexity Results for the Non-Ground Case", "Abstract": "Recent research in nonmonotonic logic programming under the answer-set semantics focuses on different notions of equivalence. In particular, strong and uniform equivalence are proposed as useful tools for optimizing (parts of) a logic program. Whereas most previous research in this direction addressed only ground logic programs (i.e., programs without variables), in this paper, we deal with the more general case of non-ground programs. More specifically, we discuss languages with both finite and infinite vocabularies and provide semantical characterizations capturing the essence of equivalence, generalizing the concepts of SE-models and UE-models, respectively, as originally introduced for propositional programs. We furthermore show that, for infinite vocabularies, uniform equivalence between disjunctive programs is undecidable, and we provide decidability results and precise complexity bounds for strong equivalence, for both finite and infinite vocabularies, and for uniform equivalence for finite vocabularies, thereby correcting a previous complexity bound for strong equivalence from the literature."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Redescription Mining", "Title": "Structure Theory and Algorithms", "Abstract": "We introduce a new data mining problem---redescription mining---that unifies considerations of conceptual clustering, constructive induction, and logical formula discovery. Redescription mining begins with a collection of sets, views it as a propositional vocabulary, and identifies clusters of data that can be defined in at least two ways using this vocabulary. The primary contributions of this paper are conceptual and theoretical: (i) we formally study the space of redescriptions underlying a dataset and characterize their intrinsic structure, (ii) we identify impossibility as well as strong possibility results about when mining redescriptions is feasible, (iii) we present several scenarios of how we can custom-build redescription mining solutions for various biases, and (iv) we outline how many problems studied in the larger machine learning community are really special cases of redescription mining. By highlighting its broad scope and relevance, we aim to establish the importance of redescription mining and make the case for a thrust in this new line of research."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Value Functions for RL-Based Behavior Transfer", "Title": "A Comparative Study", "Abstract": "Temporal difference (td) learning methods have become popular reinforcement learning techniques in recent years. td methods, relying on function approximators to generalize learning to novel situations, have had some experimental successes and have been shown to exhibit some desirable properties in theory, but have often been found slow in practice. This paper presents methods for further generalizing across tasks, thereby speeding up learning, via a novel form of behavior transfer. We compare learning on a complex task with three function approximators, a CMAC, a neural network, and an RBF, and demonstrate that behavior transfer works well with all three. Using behavior transfer, agents are able to learn one task and then markedly reduce the time it takes to learn a more complex task. Our algorithms are fully implemented and tested in the RoboCup-soccer keepaway domain."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "nFOIL", "Title": "Integrating Naïve Bayes and FOIL", "Abstract": "We present the system nFOIL. It tightly integrates the naive Bayes learning scheme with the inductive logic programming rule-learner FOIL. In contrast to previous combinations, which have employed naive Bayes only for post-processing the rule sets, nFOIL employs the naive Bayes criterion to directly guide its search. Experimental evidence shows that nFOIL performs better than both its base line algorithm FOIL or the post-processing approach, and is at the same time competitive with more sophisticated approaches."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Optimal Efficient Learning Equilibrium", "Title": "Imperfect Monitoring in Symmetric Games", "Abstract": "Efficient Learning Equilibrium (ELE) is a natural solution concept for multi-agent encounters with incomplete information. It requires the learning algorithms themselves to be in equilibrium for any game selected from a set of (initially unknown) games. In an optimal ELE, the learning algorithms would efficiently obtain the surplus the agents would obtain in an optimal Nash equilibrium of the initially unknown game which is played. The crucial part is that in an ELE deviations from the learning algorithms would become non-beneficial after polynomial time, although the game played is initially unknown. While appealing conceptually, the main challenge for establishing learning algorithms based on this concept is to isolate general classes of games where an ELE exists. Unfortunately, it has been shown that while an ELE exists for the setting in which each agent can observe all other agents’ actions and payoffs, an ELE does not exist in general when the other agents’ payoffs cannot be observed. In this paper we provide the first positive results on this problem, constructively proving the existence of an optimal ELE for the class of symmetric games where an agent can not observe other agents’ payoffs."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Transforming between Propositions and Features", "Title": "Bridging the Gap", "Abstract": "It is notoriously difficult to simultaneously deal with both probabilistic and structural representations in A.I., particularly because probability necessitates a uniform representation of the training examples. In this paper, we show how to build fully-specified probabilistic models from arbitrary propositional case descriptions about terrorist activities. Our method facilitates both reasoning and learning. Our solution is to use structural analogy to build probabilistic generalizations about those cases. We use these generalizations as a framework for mapping the structural representations, which are well-suited for reasoning, into features, which are well-suited for learning, and back again. Finally, we demonstrate how probabilistic generalizations are an excellent bridge for joining reasoning and learning by using them to perform a traditional machine learning technique, Bayesian network modeling, over arbitrarily high order structural data about terrorist actions, and further, we discuss how this might be used to facilitate automatic knowledge acquisition."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Risk-Sensitive Planning with One-Switch Utility Functions", "Title": "Value Iteration", "Abstract": "Decision-theoretic planning with nonlinear utility functions is important since decision makers are often risk-sensitive in high-stake planning situations. One-switch utility functions are an important class of nonlinear utility functions that can model decision makers whose decisions change with their wealth level. We study how to maximize the expected utility of a Markov decision problem for a given one-switch utility function, which is difficult since the resulting planning problem is not decomposable. We first study an approach that augments the states of the Markov decision problem with the wealth level. The properties of the resulting infinite Markov decision problem then allow us to generalize the standard risk-neutral version of value iteration from manipulating values to manipulating functions that map wealth levels to values. We use a probabilistic blocks-world example to demonstrate that the resulting risk-sensitive version of value iteration is practical."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Samuel Meets Amarel", "Title": "Automating Value Function Approximation Using Global State Space Analysis", "Abstract": "Most work on value function approximation adheres to Samuel’s original design: agents learn a task-specific value function using parameter estimation, where the approximation architecture (e.g, polynomials) is specified by a human designer. This paper proposes a novel framework generalizing Samuel’s paradigm using a coordinate-free approach to value function approximation. Agents learn both representations and value functions by constructing geometrically customized task-independent basis functions that form an orthonormal set for the Hilbert space of smooth functions on the underlying state space manifold. The approach rests on a technical result showing that the space of smooth functions on a (compact) Riemanian manifold has a discrete spectrum associated with the Laplace-Beltrami operator. In the discrete setting, spectral analysis of the graph Laplacian yields a set of geometrically customized basis functions for approximating and decomposing value functions. The proposed framework generalizes Samuel’s value function approximation paradigm by combining it with a formalization of Saul Amarel’s paradigm of representation learning through global state space analysis."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "TIELT", "Title": "A Testbed for Gaming Environments", "Abstract": "Many AI researchers want to test the utility of their systems\nin complex task environments defined by (e.g., real-time\nstrategy) gaming simulators and/or simulators of computergenerated\nforces. Also, many developers of commercial and\nmilitary gaming simulators seek behaviors that can be\nsupported by these systems. However, these integrations\nrequire great effort. We will demonstrate the late Alpha\nversion of TIELT, a testbed designed to fill these needs."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "DiamondHelp", "Title": "A Collaborative Task Guidance Framework for Complex Devices", "Abstract": "DiamondHelp is a reusable Java framework for building collaborative task guidance systems for complex devices, such as digitally enabled home appliances. DiamondHelp combines a generic conversational interface, adapted from online chat programs, with an application-specific direct manipulation interface. DiamondHelp provides ‘a things to say” mechanism for use without spoken language understanding; it also supports extensions to take advantage of speech technology. DiamondHelp’s software architecture factors all application-specific content into two modular plug-ins, one of which includes Collagen and a task model."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Evolution of an Empathetic Digital Entity", "Title": "Phase One", "Abstract": "This demonstration highlights the first of seven segments designed to develop a digital entity that will possess the potential for human empathy. The experiences in the first phase of the digital entity Zoe (Zero-One Entity) parallel a subset of learning and development activities encountered by human beings during their first nine months of existence. A website has been created to provide a window to observe Zoe’s experiences and action selection process in order to make her basic learning observable, cumulative, and evolutionary. The human observer is invited to influence her action selection by setting the intensity of Zoe’s digital personality traits such as assertiveness, reasoning ability, and disposition. Actions generate body-based and emotive-based feelings which are stored in memory structures. Significantly, these structures serve as a foundation for later stages of learning, understanding and reasoning."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "MADbot", "Title": "A Motivated and Goal Directed Robot", "Abstract": "In most work in plan generation and execution the assumption has been made that the goals being addressed by the planning system (and executive) are imposed externally and that once a plan has been constructed to achieve these goals the activity of the planner can cease. Similarly, once the plan has been successfully executed and a state satisfying the externally imposed goals has been reached, it has been assumed that the planning and execution behaviours will suspend until a new goal set and consequent plan has been imposed. These assumptions do not hold for fully autonomous systems, which are capable of directing their own behaviour and prioritising their own goals. The problem we are most concerned with is determining how goals arise during the autonomous behaviour of a system."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "QuOnto", "Title": "Querying Ontologies", "Abstract": "In this work, we present QUONTO, a query answering\nsystem based on DL-Lite. Our system provides three basic\nfunctionalities: (1) specification of the intensional level\nof the ontology (TBox), (2) specification of the extensional\nlevel of the ontology (ABox), and (3) query answering."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "SAGA-ML", "Title": "An Active Learning System for Semiautomated Gameplay Analysis", "Abstract": "As software systems grow, software testing has become increasingly onerous. Consequently, statistical software testing and machine learning techniques have become increasingly attractive. Following these approaches, we present SAGA-ML (Semi-Automated Gameplay Analysis by Machine Learning), an active learning system for blackbox software testing, and SoccerViz, an analysis vizualization tool for Electronic Arts’ FIFA Soccer game. SAGA-ML was developed in the context of commercial video games, complex virtual worlds with state spaces too large for exhaustive testing. Beyond program correctness, developers must evaluate the gameplay of a game (e.g. its difficulty). SAGA-ML, which is not game-specific, samples the blackbox software system to learn a model of the system’s behaviour. This model is used to i) select new points for sampling, and ii) summarize the game’s behaviour for the developer. The demonstration shows how models learned by SAGA-ML (generated offline) can be visualized and explored by the developer via the game-specific SoccerViz tool."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "SenseRelate", "Title": ":TargetWord-A Generalized Framework for Word Sense Disambiguation", "Abstract": "Many words in natural language have different meanings when used in different contexts. SenseRelate::TargetWord is a Perl package that disambiguates a target word in context by finding the sense that is most related to its neighbors according to a WordNet::Similarity measure of relatedness."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Solo", "Title": "A Cognitive Orthosis", "Abstract": "Solo is a cognitive assistive device which provides support in remembering when to perform tasks, executing the steps in a task, and recovering from unexpected events. The system includes an interface for clients to receive reminders, an interface for caregivers to enter information about the client’s scheduled tasks, and a Cognition Manager which provides reminders and task guidance at appropriate times."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Swoogle", "Title": "Searching for Knowledge on the Semantic Web", "Abstract": "The Semantic Web’s distributed nature raises significant data access problems — how can an agent discover, index, search and navigate knowledge on the Semantic Web? Swoogle was developed to facilitate webscale semantic web data access by providing these services to both human and software agents. It focuses on two levels of knowledge granularity: URI based semantic web vocabulary and semantic web documents (SWDs), i.e., RDF and OWL documents encoded in XML, NTriples or N3."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Supervised Ranking for Pronoun Resolution", "Title": "Some Recent Improvements", "Abstract": "A recently-proposed machine learning approach to reference resolution --- the twin-candidate approach --- has been shown to be more promising than the traditional single-candidate approach. This paper presents a pronoun interpretation system that extends the twin-candidate framework by (1) equipping it with the ability to identify non-referential pronouns, (2) training different models for handling different types of pronouns, and (3) incorporating linguistic knowledge sources that are generally not employed in traditional pronoun resolvers. The resulting system, when evaluated on a standard coreference corpus, outperforms not only the original twin-candidate approach but also a state-of-the-art pronoun resolver."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Cross-Lingual Bootstrapping of Semantic Lexicons", "Title": "The Case of FrameNet", "Abstract": "This paper considers the problem of unsupervised semantic lexicon acquisition. We introduce a fully automatic approach which exploits parallel corpora, relies on shallow text properties, and is relatively inexpensive. Given the English FrameNet lexicon, our method exploits word alignments to generate frame candidate list for new languages, which are subsequently pruned automatically using a small set of linguistically motivated filters. Evaluation shows that our approach can produce high-precision multilingual FrameNet lexicons without recourse to bilingual dictionaries or deep syntactic and semantic analysis."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Prottle", "Title": "A Probabilistic Temporal Planner", "Abstract": "Planning with concurrent durative actions and probabilistic effects, or"}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Fast Planning in Domains with Derived Predicates", "Title": "An Approach Based on Rule-Action Graphs and Local Search", "Abstract": "The ability to express \"derived predicates\" in the formalization of a planning domain is both practically and theoretically important. In this paper, we propose an approach to planning with derived predicates where the search space consists of \"Rule-Action Graphs\", particular graphs of actions and rules representing derived predicates. We present some techniques for representing rules and reasoning with them, which are integrated into a method for planning through local search and rule-action graphs. We also propose some new heuristics for guiding the search, and some experimental results illustrating the performance of our approach. Our proposed techniques are implemented in a planner that took part in the fourth International Planning Competition showing good performance in many benchmark problems."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Consciousness", "Title": "Drinking from the Firehose of Experience", "Abstract": "The problem of consciousness has captured the imagination of philosophers, neuroscientists, and the general public, but has received little attention within AI. However, concepts from robotics and computer vision hold great promise to account for the major aspects of the phenomenon of consciousness, including philosophically problematical aspects such as the vividness of qualia, the first-person character of conscious experience, and the property of intentionality. This paper presents and evaluates such an account against eleven features of consciousness \"that any philosophical-scientific theory should hope to explain\", according to the philosopher and prominent AI critic John Searle."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Bitbots", "Title": "Simple Robots Solving Complex Tasks", "Abstract": "Sensing uncertainty is a central issue in robotics. Sensor limitations often prevent accurate state estimation, and robots find themselves confronted with a complicated"}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "The Max K-Armed Bandit", "Title": "A New Model of Exploration Applied to Search Heuristic Selection", "Abstract": "The multiarmed bandit is often used as an analogy for the tradeoff between exploration and exploitation in search problems. The classic problem involves allocating trials to the arms of a multiarmed slot machine to maximize the expected sum of rewards. We pose a new variation of the multiarmed bandit---the Max K-Armed Bandit---in which trials must be allocated among the arms to maximize the expected best single sample reward of the series of trials. Motivation for the Max K-Armed Bandit is the allocation of restarts among a set of multistart stochastic search algorithms. We present an analysis of this Max K-Armed Bandit showing under certain assumptions that the optimal strategy allocates trials to the observed best arm at a rate increasing double exponentially relative to the other arms. This motivates an exploration strategy that follows a Boltzmann distribution with an exponentially decaying temperature parameter. We compare this exploration policy to policies that allocate trials to the observed best arm at rates faster (and slower) than double exponentially. The results confirm, for two scheduling domains, that the double exponential increase in the rate of allocations to the observed best heuristic outperforms the other approaches."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "WebCrow", "Title": "A Web-Based System for Crossword Solving", "Abstract": "Language games represent one of the most fascinating challenges of research in artificial intelligence. In this paper we give an overview of WebCrow, a system that tackles crosswords using the Web as a knowledge base. This appears to be a novel approach with respect to the available literature. It is also the first solver for non- English crosswords and it has been designed to be potentially multilingual. Although WebCrow has been implemented only in a preliminary version, it already displays very interesting results reaching the performance of a human beginner: crosswords that are \"easy\" for expert humans are solved, within competition time limits, with 80 percent of correct words and over 90 percent of correct letters."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Searching for Common Sense", "Title": "Populating Cyc™ from the Web", "Abstract": "The Cyc project is predicated on the idea that effective machine learning depends on having a core of knowledge that provides a context for novel learned information - what is known informally as \"common sense.\" Over the last twenty years, a sufficient core of common sense knowledge has been entered into Cyc to allow it to begin effectively and flexibly supporting its most important task: increasing its own store of world knowledge. In this paper, we present initial work on a method of using a combination of Cyc and the World Wide Web, accessed via Google, to assist in entering knowledge into Cyc. The long-term goal is automating the process of building a consistent, formalized representation of the world in the Cyc knowledge base via machine learning. We present initial results of this work and describe how we expect the knowledge acquisition process to become more accurate, faster, and more automated in the future."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Automatic Text Summarization of Newswire", "Title": "Lessons Learned from the Document Understanding Conference", "Abstract": "Since 2001, the Document Understanding Conferences have been the forum for researchers in automatic text summarization to compare methods and results on common test sets. Over the years, several types of summarization tasks have been addressed---single document summarization, multi-document summarization, summarization focused by question, and headline generation. This paper is an overview of the achieved results in the different types of summarization tasks. We compare both the broader classes of baselines, systems and humans, as well as individual pairs of summarizers (both human and automatic). An analysis of variance model is fitted, with summarizer and input set as independent variables, and the coverage score as the dependent variable, and simulation-based multiple comparisons were performed. The results document the progress in the field as a whole, rather then focusing on a single system, and thus can serve as a future reference on the work done up to date, as well as a starting point in the formulation of future tasks. Results also indicate that most progress in the field has been achieved in generic multi-document summarization and that the most challenging task is that of producing a focused summary in answer to a question/topic."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Qualitative Dimensions in Question Answering", "Title": "Extending the Definitional QA Task", "Abstract": "Current question answering tasks handle definitional questions by seeking answers which are factual in nature. While factual answers are a very important component in defining entities, a wealth of qualitative data is often ignored. In this incipient work, we define qualitative dimensions (credibility, sentiment, contradictions etc.) for evaluating answers to definitional questions and we explore potential benefits to users. These qualitative dimensions are leveraged to uncover indirect and implicit answers and can help satisfy the user’s information need."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "DR-Prolog", "Title": "A System for Reasoning with Rules and Ontologies on the Semantic Web", "Abstract": "Defeasible reasoning is a rule-based approach for efficient reasoning with incomplete and inconsis-tent information. Such reasoning is, among others, useful for ontology integration, where conflicting information arises naturally; and for the modeling of business rules and policies, where rules with ex-ceptions are often used. This paper describes these scenarios in more detail, and reports on the imple-mentation of a system for defeasible reasoning on the Web. The system (a) is syntactically compati-ble with RuleML; (b) features strict and defeasible rules, priorities and two kinds of negation; (c) is based on a translation to logic programming with declarative semantics; (d) is flexible and adaptable to different intuitions within defeasible reasoning; and (e) can reason with rules, RDF, RDF Schema and (parts of) OWL ontologies."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Rover Science Autonomy", "Title": "Probabilistic Planning for Science-Aware Exploration", "Abstract": "Future Mars rovers will have the ability to autonomously navigate for distances of kilometers. In one sol a traverse may take a rover into unexplored areas beyond its local horizon. The rover can explore these areas more effectively if it is able to detect and react to science opportunities on its own, what we call science autonomy. We are studying science autonomy in two ways: first, by implementing a simple science autonomy system on a rover in the field, and second, by developing probabilistic planning technology that can enable more principled autonomous decision-making in future systems."}
{"Type": "conference", "Year": "2005", "Area": "AI", "Where": "AAAI", "Abbreviation": "Dissertation in Progress", "Title": "An Empirical Analysis of the Costs and Benefits of Naturalness in Spoken Dialog Systems", "Abstract": "In this paper I describe work for my Ph.D. dissertation which is currently in progress. The overarching goal of the work is to develop a methodology for empirically evaluating the effects of different interface design decisions in spoken dialogue systems. The methodology I will use is the dual-task method, borrowed from cognitive psychology, which is advantageous because it provides fine-grained information about the cognitive load of the user while he/she is engaged in interacting with the system. For my dissertation I will focus specifically on the use of definite referring expressions and the question of whether “natural” or “fully-specified” definite referring expressions are easier for users to generate and/or understand. The answers are important because both strategies are used in systems on the market today. More importantly, I hope my work will provide a tool for software developers, and encourage them to carefully weigh the empirically observed costs and benefits of various design decisions."}
