{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "A Holistic Approach to Compositional Semantics", "Title": "a connectionist model and robot experiments", "Abstract": "We present a novel connectionist model for acquiring the semantics of a simple language through the behavioral experiences of a real robot. We focus on the “compositionality” of semantics, a fundamental character- istic of human language, which is the ability to understand the meaning of a sentence as a combination of the meanings of words. We also pay much attention to the “embodiment” of a robot, which means that the robot should acquire semantics which matches its body, or sensory-motor system. The essential claim is that an embodied compositional semantic representation can be self-organized from generalized correspondences between sentences and behavioral patterns. This claim is examined and conﬁrmed through simple experiments in which a robot generates corre- sponding behaviors from unlearned sentences by analogy with the corre- spondences between learned sentences and behaviors."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Simplicial Mixtures of Markov Chains", "Title": "Distributed Modelling of Dynamic User Profiles", "Abstract": "To provide a compact generative representation of the sequential activ- ity of a number of individuals within a group there is a tradeoff between the deﬁnition of individual speciﬁc and global models. This paper pro- poses a linear-time distributed model for ﬁnite state symbolic sequences representing traces of individual user activity by making the assump- tion that heterogeneous user behavior may be ‘explained’ by a relatively small number of common structurally simple behavioral patterns which may interleave randomly in a user-speciﬁc proportion. The results of an empirical study on three different sources of user traces indicates that this modelling approach provides an efﬁcient representation scheme, re- ﬂected by improved prediction performance as well as providing low- complexity and intuitively interpretable representations."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Towards Social Robots", "Title": "Automatic Evaluation of Human-Robot Interaction by Facial Expression Classification", "Abstract": "Computer animated agents and robots bring a social dimension to hu- man computer interaction and force us to think in new ways about how computers could be used in daily life. Face to face communication is a real-time process operating at a time scale of less than a second. In this paper we present progress on a perceptual primitive to automatically detect frontal faces in the video stream and code them with respect to 7 dimensions in real time: neutral, anger, disgust, fear, joy, sadness, sur- prise. The face ﬁnder employs a cascade of feature detectors trained with boosting techniques [13, 2]. The expression recognizer employs a novel combination of Adaboost and SVM’s. The generalization performance to new subjects for a 7-way forced choice was 93.3% and 97% correct on two publicly available datasets. The outputs of the classiﬁer change smoothly as a function of time, providing a potentially valuable repre- sentation to code facial expression dynamics in a fully automatic and unobtrusive manner. The system was deployed and evaluated for mea- suring spontaneous facial expressions in the ﬁeld in an application for automatic assessment of human-robot interaction."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Large Margin Classifiers", "Title": "Convex Loss, Low Noise, and Convergence Rates", "Abstract": "Many classiﬁcation algorithms, including the support vector machine, boosting and logistic regression, can be viewed as minimum contrast methods that minimize a convex surrogate of the 0-1 loss function. We characterize the statistical consequences of using such a surrogate by pro- viding a general quantitative relationship between the risk as assessed us- ing the 0-1 loss and the risk as assessed using any nonnegative surrogate loss function. We show that this relationship gives nontrivial bounds un- der the weakest possible condition on the loss function—that it satisfy a pointwise form of Fisher consistency for classiﬁcation. The relationship is based on a variational transformation of the loss function that is easy to compute in many applications. We also present a reﬁned version of this result in the case of low noise. Finally, we present applications of our results to the estimation of convergence rates in the general setting of function classes that are scaled hulls of a ﬁnite-dimensional base class."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "The Doubly Balanced Network of Spiking Neurons", "Title": "A Memory Model with High Capacity", "Abstract": "A balanced network leads to contradictory constraints on memory  models, as exemplified in previous work on accommodation of  synfire chains. Here we show that these constraints can be  overcome by introducing a 'shadow' inhibitory pattern for each  excitatory pattern of the model. This is interpreted as a double- balance principle, whereby there exists both global balance  between average excitatory and inhibitory currents and local  balance between the currents carrying coherent activity at any  given time frame. This principle can be applied to networks with  Hebbian cell assemblies, leading to a high capacity of the  associative memory. The number of possible patterns is limited by  a combinatorial constraint that turns out to be P=0.06N within the  specific model that we employ. This limit is reached by the  Hebbian cell assembly network. To the best of our knowledge this  is the first time that such high memory capacities are demonstrated  in the asynchronous state of models of spiking neurons."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Factorization with Uncertainty and Missing Data", "Title": "Exploiting Temporal Coherence", "Abstract": "The problem of \\Structure From Motion\" is a central problem in vision: given the 2D locations of certain points we wish to recover the camera motion and the 3D coordinates of the points. Un- der simpliﬂed camera models, the problem reduces to factorizing a measurement matrix into the product of two low rank matrices. Each element of the measurement matrix contains the position of a point in a particular image. When all elements are observed, the problem can be solved trivially using SVD, but in any realistic sit- uation many elements of the matrix are missing and the ones that are observed have a diﬁerent directional uncertainty. Under these conditions, most existing factorization algorithms fail while human perception is relatively unchanged. In this paper we use the well known EM algorithm for factor analy- sis to perform factorization. This allows us to easily handle missing data and measurement uncertainty and more importantly allows us to place a prior on the temporal trajectory of the latent variables (the camera position). We show that incorporating this prior gives a signiﬂcant improvement in performance in challenging image se- quences."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Using the Forest to See the Trees", "Title": "A Graphical Model Relating Features, Objects, and Scenes", "Abstract": "Standard approaches to object detection focus on local patches of the image, and try to classify them as background or not. We propose to use the scene context (image as a whole) as an extra source of (global) information, to help resolve local ambiguities. We present a conditional random ﬁeld for jointly solving the tasks of object detection and scene classiﬁcation."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Information Maximization in Noisy Channels ", "Title": "A Variational Approach", "Abstract": "The maximisation of information transmission over noisy channels is a common, albeit generally computationally diﬃcult problem. We approach the diﬃculty of computing the mutual information for noisy channels by using a variational approximation. The re- sulting IM algorithm is analagous to the EM algorithm, yet max- imises mutual information, as opposed to likelihood. We apply the method to several practical examples, including linear compression, population encoding and CDMA."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Mechanism of Neural Interference by Transcranial Magnetic Stimulation", "Title": "Network or Single Neuron?", "Abstract": "This paper proposes neural mechanisms of transcranial magnetic stim- ulation (TMS). TMS can stimulate the brain non-invasively through a brief magnetic pulse delivered by a coil placed on the scalp, interfering with speciﬁc cortical functions with a high temporal resolution. Due to these advantages, TMS has been a popular experimental tool in various neuroscience ﬁelds. However, the neural mechanisms underlying TMS- induced interference are still unknown; a theoretical basis for TMS has not been developed. This paper provides computational evidence that in- hibitory interactions in a neural population, not an isolated single neuron, play a critical role in yielding the neural interference induced by TMS."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Optimal Manifold Representation of Data", "Title": "An Information Theoretic Approach", "Abstract": "Suppose that we have a data set X in a high dimensional state space RD described by a density function ρ(x). We would like to ﬁnd a “simpliﬁed” description of this data set. One may do so by visualizing a lower dimensional manifold M that “almost” describes the data. If we have a manifold M and a stochastic map PM : x → PM(µ|x) to points µ on the manifold, we will say that they provide a manifold description of the data set X. Note that the stochastic map here is well justiﬁed: if a data point does not lie exactly on the manifold then we should expect some uncertainty in the estimation of the value of its latent variables. Also note that we do not need to specify the inverse (generative) map: M → RD; it can be obtained by Bayes’ rule. The manifold description (M, PM) is a less than faithful representation of the data. To formalize this notion we will introduce the distortion measure D(M, PM, ρ):"}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "All learning is Local", "Title": "Multi-agent Learning in Global Reward Games", "Abstract": "In large multiagent games, partial observability, coordination, and credit assignment persistently plague attempts to design good learning algo- rithms. We provide a simple and efﬁcient algorithm that in part uses a linear system to model the world from a single agent’s limited per- spective, and takes advantage of Kalman ﬁltering to allow an agent to construct a good training signal and learn an effective policy."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "Attractive People", "Title": "Assembling Loose-Limbed Models using Non-parametric Belief Propagation", "Abstract": "The detection and pose estimation of people in images and video is made challenging by the variability of human appearance, the complexity of natural scenes, and the high dimensionality of articulated body mod- els. To cope with these problems we represent the 3D human body as a graphical model in which the relationships between the body parts are represented by conditional probability distributions. We formulate the pose estimation problem as one of probabilistic inference over a graphi- cal model where the random variables correspond to the individual limb parameters (position and orientation). Because the limbs are described by 6-dimensional vectors encoding pose in 3-space, discretization is im- practical and the random variables in our model must be continuous- valued. To approximate belief propagation in such a graph we exploit a recently introduced generalization of the particle ﬁlter. This framework facilitates the automatic initialization of the body-model from low level cues and is robust to occlusion of body parts and scene clutter."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "GPPS", "Title": "A Gaussian Process Positioning System for Cellular Networks", "Abstract": "In this article, we present a novel approach to solving the localization problem in cellular networks. The goal is to estimate a mobile user’s position, based on measurements of the signal strengths received from network base stations. Our solution works by building Gaussian process models for the distribution of signal strengths, as obtained in a series of calibration measurements. In the localization stage, the user’s posi- tion can be estimated by maximizing the likelihood of received signal strengths with respect to the position. We investigate the accuracy of the proposed approach on data obtained within a large indoor cellular network."}
{"Type": "conference", "Year": "2003", "Area": "AI", "Where": "NeurIPS", "Abbreviation": "ARA*", "Title": "Anytime A* with Provable Bounds on Sub-Optimality", "Abstract": "In real world planning problems, time for deliberation is often limited. Anytime planners are well suited for these problems: they ﬁnd a feasi- ble solution quickly and then continually work on improving it until time runs out. In this paper we propose an anytime heuristic search, ARA, which tunes its performance bound based on available search time. It starts by ﬁnding a suboptimal solution quickly using a loose bound, then tightens the bound progressively as time allows. Given enough time it ﬁnds a provably optimal solution. While improving its bound, ARA reuses previous search efforts and, as a result, is signiﬁcantly more efﬁ- cient than other anytime search methods. In addition to our theoretical analysis, we demonstrate the practical utility of ARA* with experiments on a simulated robot kinematic arm and a dynamic path planning prob- lem for an outdoor rover."}
